package com.mhmdreza.azmoonyar.data.quizes

import com.mhmdreza.azmoonyar.data.AnswerType
import com.mhmdreza.azmoonyar.data.Question
import com.mhmdreza.azmoonyar.data.Quiz

fun getQuiz4(): Quiz {
    val quiz = Quiz(
        4,
        "راهنمای پرسشنامه فرزندپروری آلاباما (فرم والدين)",
        "desc2",
        AnswerType.FREQUENCY_LEVEL
    )
    questions4.forEachIndexed { index, s ->
        quiz.questions.add(Question(index + 1, s))
    }
    return quiz
}

val questions4 = arrayListOf(
    "با فرزندتان صحبت\u200Cهاي دوستانه\u200Cاي داريد.",
    "زماني كه فرزندتان كار خوبي انجام مي\u200Cدهد، شما او را متوجه آن كار خوب مي\u200Cكنيد.",
    "فرزندتان را تهديد به تنبيه مي\u200Cكنيد، اما بعداً تنبيهش نمي\u200Cكنيد.",
    "داوطلب كمك به فعاليت\u200Cهاي خاصي كه فرزندتان درگير آن است، مي\u200Cشويد (مثلاً بازي، ورزش، فعاليت\u200Cهاي گروه\u200Cهاي مذهبي و ...).",
    "رفتار خوب فرزندتان را با جايزه يا پاداش مورد تشويق قرار مي\u200Cدهيد.",
    "اگر فرزندتان بخواهد جايي برود براي شما يادداشت نمي\u200Cگذارد تا بدانيد كه كجا رفته است.",
    "با فرزندتان به بازي و تفريح مي\u200Cپردازيد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد بدون آنكه تنبيه شود، با او صحبت مي\u200Cكنيد.",
    "در مورد فعاليت\u200Cهاي روزانه فرزندتان در مدرسه پرس و جو مي\u200Cكنيد.",
    "فرزندتان غروب، پس از زماني كه انتظار مي\u200Cرود در خانه باشد، بيرون مي\u200Cماند.",
    "در انجام تكاليف مدرسه به فرزندتان كمك مي\u200Cكنيد.",
    "تلاش شما براي وادار كردن فرزندتان به انجام كارها بيهوده است چون اين كار برايتان دشوار است.",
    "وقتي فرزندتان كار خوبي انجام مي\u200Cدهد، شما او را تحسين مي\u200Cكنيد.",
    "از فرزندتان در مورد برنامه\u200Cاي كه براي فرداي آن روز دارد، پرس و جو مي\u200Cكنيد.",
    "فرزندتان را به انجام كارهاي خاصي وادار مي\u200Cكنيد.",
    "به خاطر رفتار خوبي كه فرزندتان داشته است، به او جايزه مي\u200Cدهيد.",
    "دوستان فرزندتان (آن\u200Cهايي كه با او هستند) را نمي\u200Cشناسيد.",
    "وقتي فرزندتان كار خوبي انجام مي\u200Cدهد، وي را به آغوش مي\u200Cكشيد يا مي\u200Cبوسيد.",
    "فرزندتان بدون آنكه ساعت بازگشت خود را مشخص كند از خانه خارج مي\u200Cشود.",
    "فرزندتان درباره دوستانش با شما صحبت مي\u200Cكند.",
    "فرزندتان پس از تاریک شدن هوا، بدون همراهی شما بیرون می\u200Cرود.",
    "زودتر از موعد مقرر تنبيه فرزندتان را قطع مي\u200Cكنيد (مثلاً برداشتن محدوديت زودتر از آنچه، اول گفته\u200Cايد).",
    "فرزندتان در برنامه\u200Cريزي فعاليت\u200Cهاي خانوادگي كمك مي\u200Cكند.",
    "شما آنقدر مشغول مي\u200Cشويد كه فراموش مي\u200Cكنيد فرزندتان كجاست و چه مي\u200Cكند.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، تنبيهش نمي\u200Cكنيد.",
    "در جلسات اوليا و مربيان، يا ديگر جلسات مدرسه فرزندتان شركت مي\u200Cكنيد.",
    "وقتي فرزندتان در امور خانه كمك مي\u200Cكند، شما به او مي\u200Cگوييد كه از كارش خشنود شده\u200Cايد.",
    "وقتي فرزندتان دير به خانه مي\u200Cآيد، شما متوجه دير آمدن او نمي\u200Cشويد.",
    "بدون اينكه به فرزندتان بگوييد به كجا می\u200Cرويد، خانه را ترك مي\u200Cكنيد.",
    "فرزندتان با بيش از يك ساعت تأخير از زمان تعيين شده\u200Cاي كه شما منتظرش هستید، از مدرسه به خانه مي\u200Cآيد.",
    "شكل و نوع تنبيهي كه براي فرزندتان به كار مي\u200Cبريد، به وضعيت روحي\u200Cتان بستگي دارد.",
    "فرزندتان بدون اينكه بزرگتري با او باشد، در خانه تنهاست.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، با دست محكم به پشت او مي\u200Cزنيد.",
    "وقتي فرزندتان رفتار اشتباهي انجام مي\u200Cدهد، مورد بي\u200Cاعتنايي شما قرار مي\u200Cگيرد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، به او سيلي مي\u200Cزنيد.",
    "امتيازات يا پولي را كه به فرزندتان داده\u200Cايد، به عنوان تنبيه از او پس مي\u200Cگيريد.",
    "براي تنبيه، فرزندتان را به اتاقش مي\u200Cفرستيد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، شما او را با كمربند، دسته كليد يا اشيای ديگر مي\u200Cزنيد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، شما سرش داد و فرياد مي\u200Cكنيد.",
    "هنگامي كه فرزندتان بدرفتاري مي\u200Cكند، شما با خونسردي توضيخ مي\u200Cدهيد كه چرا رفتارش اشتباه بوده است.",
    "براي تنبيه فرزندتان از روش محروم كردن استفاده مي\u200Cكنيد (مثلاً براي مدتي او را از انجام فعاليت\u200Cهاي مورد علاقه\u200Cاش منع مي\u200Cكنيد).",
    "به عنوان تنبيه فرزندتان را وادار به انجام كارهاي سخت مي\u200Cكنيد."
)