package com.mhmdreza.azmoonyar.data.quizes

import com.mhmdreza.azmoonyar.data.AnswerType
import com.mhmdreza.azmoonyar.data.Question
import com.mhmdreza.azmoonyar.data.Quiz

fun getQuiz5(): Quiz {
    val quiz = Quiz(
        5,
        "راهنمای پرسشنامه فرزندپروری آلاباما (فرم كودكان)",
        "desc2",
        AnswerType.FREQUENCY_LEVEL
    )
    questions5.forEachIndexed { index, s ->
        quiz.questions.add(Question(index + 1, s))
    }
    return quiz
}

val questions5 = arrayListOf(
    "با مادرتان صحبت\u200Fهاي دوستانه\u200Fاي داريد.",
    "با پدرتان صحبت\u200Fهاي دوستانه\u200Fاي داريد.",
    "زماني كه كار خوبي انجام مي\u200Fدهيد، والدينتان شما را متوجه آن كار خوب مي\u200Fكنند.",
    "والدينتان شما را تهديد به تنبيه مي\u200Fكنند، اما بعداً تنبيه\u200Cتان نمي\u200Fكنند.",
    "مادرتان داوطلب كمك به فعاليت\u200Fهاي خاصي كه شما درگير آن هستيد مي\u200Fشود (مثلاً بازي، ورزش، فعاليت\u200Fهاي گروه\u200Fهاي مذهبي و ...).",
    "پدرتان داوطلب كمك به فعاليت\u200Fهاي خاصي كه شما درگير آن هستيد مي\u200Fشود (مثلاً بازي، ورزش، فعاليت\u200Fهاي گروه\u200Fهاي مذهبي و ...).",
    "والدينتان رفتار خوب شما را با جايزه يا پاداش مورد تشويق قرار مي\u200Fدهند.",
    "اگر شما بخواهيد جايي برويد براي والدينتان يادداشت نمي\u200Fگذاريد تا بدانند كه كجا رفته\u200Fايد.",
    "با مادرتان به بازي و تفريح مي\u200Fپردازيد.",
    "با پدرتان به بازي و تفريح مي\u200Fپردازيد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد بدون آنكه تنبيه شويد، با والدينتان صحبت مي\u200Fكنيد.",
    "مادرتان در مورد فعاليت\u200Fهاي روزانه شما در مدرسه پرس و جو مي\u200Fكند.",
    "پدرتان در مورد فعاليت\u200Fهاي روزانه شما در مدرسه پرس و جو مي\u200Fكند.",
    "غروب، پس از زماني كه انتظار مي\u200Fرود در خانه باشيد، بيرون مي\u200Fمانيد.",
    "مادرتان در انجام تكاليف مدرسه به شما كمك مي\u200Fكند.",
    "پدرتان در انجام تكاليف مدرسه به شما كمك مي\u200Fكند.",
    "تلاش والدينتان براي وادار كردن شما به انجام كارها بيهوده است چون آن\u200Cها مي\u200Fدانند اين كار برايشان دشوار است.",
    "وقتي كار خوبي انجام مي\u200Fدهيد، والدينتان شما را تحسين مي\u200Fكنند.",
    "مادرتان از شما در مورد برنامه\u200Fاي كه براي فرداي آن روز داريد، پرس و جو مي\u200Fكند.",
    "پدرتان از شما در مورد برنامه\u200Fاي كه براي فرداي آن روز داريد، پرس و جو مي\u200Fكند.",
    "مادرتان شما را به انجام كارهاي خاصي وادار مي\u200Fكند.",
    "پدرتان شما را به انجام كارهاي خاصي وادار مي\u200Fكند.",
    "به خاطر رفتار خوبي كه داشته\u200Fايد، والدينتان به شما جايزه مي\u200Fدهند.",
    "والدينتان دوستان (آنهايي كه با شما هستند) شما را نمي\u200Fشناسند.",
    "وقتي كار خوبي انجام مي\u200Fدهيد، والدينتان شما را به آغوش مي\u200Fكشند يا مي\u200Fبوسند.",
    "بدون آنكه ساعت بازگشت خود را مشخص كنيد از خانه خارج مي\u200Fشويد.",
    "مادرتان درباره دوستانتان با شما صحبت مي\u200Fكند.",
    "پدرتان درباره دوستانتان با شما صحبت مي\u200Fكند.",
    "پس از تاریک شدن هوا، بدون همراهی پدر یا مادرتان بیرون می\u200Cروید.",
    "والدينتان زودتر از موعد مقرر تنبيه شما را قطع مي\u200Fكنند (مثلاً برداشتن محدوديت، زودتر از آنچه اول گفته\u200Fاند).",
    "شما در برنامه\u200Fريزي فعاليت\u200Fهاي خانوادگي كمك مي\u200Fكنيد.",
    "والدينتان آنقدر مشغول مي\u200Fشوند كه فراموش مي\u200Fكنند شما كجاييد و چه مي\u200Fكنيد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد، والدينتان تنبيه\u200Cتان نمي\u200Fكنند.",
    "مادرتان در جلسات اوليا و مربيان، يا ديگر جلسات مدرسه شركت مي\u200Fكند.",
    "پدرتان در جلسات اوليا و مربيان، يا ديگر جلسات مدرسه شركت مي\u200Fكند.",
    "وقتي در امور خانه كمك مي\u200Fكنيد، والدينتان به شما مي\u200Fگويند كه از كار شما خشنود شده\u200Fاند.",
    "وقتي شما دير به خانه مي\u200Fآيد، والدينتان متوجه دير آمدن شما نمي\u200Fشوند.",
    "والدينتان بدون اينكه به شما بگويند به كجا مي\u200Fروند، خانه را ترك مي\u200Fكنند.",
    "شما با بيش از يك ساعت تأخير از زمان تعيين شده\u200Fاي كه والدينتان منتظرتان هستند، از مدرسه به خانه مي\u200Fآييد.",
    "شكل و نوع تنبيهي كه والدينتان براي شما به كار مي\u200Fبرند، به وضعيت روحيشان بستگي دارد.",
    "شما بدون اينكه بزرگتري با شما باشد، در خانه تنهاييد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد، والدينتان با دست محكم به پشت شما مي\u200Fزنند.",
    "وقتي رفتار اشتباهي انجام مي\u200Fدهيد، مورد بي\u200Fاعتنايي والدينتان قرار مي\u200Fگيريد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد، والدينتان به شما سيلي مي\u200Fزنند.",
    "والدينتان امتيازات يا پولي را كه به شما داده\u200Fاند، به عنوان تنبيه از شما پس مي\u200Fگيرند.",
    "والدينتان براي تنبيه، شما را به اتاقتان مي\u200Fفرستند.",
    "وقتي شما كار اشتباهي انجام مي\u200Fدهيد، والدينتان شما را با كمربند، دسته كليد يا اشيای ديگر مي\u200Fزنند.",
    "وقتي شما كار اشتباهي انجام مي\u200Fدهيد، والدينتان سرتان داد و فرياد مي\u200Fكنند.",
    "هنگامي كه شما بدرفتاري مي\u200Fكنيد، والدينتان با خونسردي توضيح مي\u200Fدهند كه چرا رفتارتان اشتباه بوده است.",
    "والدينتان براي تنبيه شما از روش محروم كردن استفاده مي\u200Fكنند (مثلاً براي مدتي شما را از انجام فعاليت\u200Fهاي مورد علاقه\u200Fتان منع مي\u200Fكنند).",
    "والدينتان به عنوان تنبيه شما را وادار به انجام كارهاي سخت مي\u200Fكنند."
)