package com.mhmdreza.azmoonyar.data.quizes

import android.text.Spannable
import android.text.SpannableStringBuilder
import androidx.core.text.bold
import androidx.core.text.toSpannable
import com.mhmdreza.azmoonyar.data.Answer
import com.mhmdreza.azmoonyar.data.AnswerType
import com.mhmdreza.azmoonyar.data.Question
import com.mhmdreza.azmoonyar.data.Quiz

fun getQuiz3(): Quiz {
    val quiz = Quiz(
        2,
        "پرسشنامه شيوه\u200Cهاي فرزندپروري بامريند",
        getDescription(),
        AnswerType.AGREEMENT_LEVEL_5
    )
    questions3.forEachIndexed { index, s ->
        quiz.questions.add(Question(index + 1, s))
    }
    return quiz
}

private fun getDescription(): Spannable {
    return SpannableStringBuilder()
        .bold { append("معرفی\n") }
        .append(
            "اين ابزار اقتباسي است از نظريه اقتدار والدين كه بر اساس نظريه بامريند از آزادگذاري، استبدادي و اقتدار منطقي والدين، براي بررسي الگوهاي نفوذ و شيوه\u200Cهاي فرزندپروري ساخته شده است. اين پرسشنامه شامل 30 ماده است كه 10 ماده آن به شيوه آزادگذاري مطلق، 10 ماده به شيوه استبدادي و 10 ماده ديگر به شيوه اقتدار منطقي والدين در امر پرورش فرزند مربوط مي\u200Cشود. " + "\n"
        )
        .bold { append("والدين گرامي: با سلام\n") }
        .append(
            "\n" +
                    "معمولاً والدين روش\u200Cهاي متفاوتي براي تربيت فرزندان به\u200Cكار مي\u200Cگيرند. در ادامه عباراتي می\u200Cآید كه برخي از روش\u200Cهاي فرزندپروري را توصيف مي\u200Cكند. پاسخ هر عبارت در يك پيوستار 5 درجه\u200Cاي از كاملاً موافقم تا كاملاً مخالفم قرار گرفته است. لطفاً هر يك از عبارات را به\u200Cدقت مطالعه كرده و مناسب\u200Cترين پاسخ كه با نگرش تربيتي شما هماهنگ است را انتخاب كنيد."
        )
        .toSpannable()
}

val questions3 = arrayListOf(
    "والدين بايد به بچه\u200Cهاي خود اجازه دهند تا هر آنچه را كه مي\u200Cخواهند انجام دهند.",
    "بچه\u200Cها بايد فقط از آنچه كه والدينشان مي\u200Cگويند پيروي كنند و در غير اين صورت بايد آنها را تنبيه كرد.",
    "اگر به مشكلات بچه\u200Cها توجه شود اين دردسر را به دنبال دارد كه آنها پرروتر شده و انتظارات بيشتري از والدين خواهند داشت.",
    "هرگاه والدين تصميمي براي بچه\u200Cها بگيرند بايد دلايل آن را به آنها بگويند.",
    "اگر بچه\u200Cها نسبت به محدوديت ايجاد شده در خانواده اعتراض كردند، والدين بايد با صحبت كردن آنها را قانع كنند.",
    "والدين نبايد در كارهاي مربوط به بچه\u200Cها دخالت كنند چون بچه\u200Cها به\u200Cطور ذاتي راه خودشان را پيدا مي\u200Cكنند.",
    "اگر بچه\u200Cها كاملاً مطابق ميل والدين خود رفتار كنند در آينده افراد موفقي خواهند شد. ",
    "بچه\u200Cها بايد كاري را كه والدين از آنها انتظار دارند انجام دهند، اما اگر انتظارات والدين غير قابل اجرا بود بايد بتوانند آن\u200C را آزادانه با والدين خود مطرح كنند. ",
    "وقتي والدين از بچه\u200Cها مي\u200Cخواهند تا كاري را انجام دهند، بچه\u200Cها بايد بدون چون و چرا آن\u200Cرا انجام دهند.",
    "والدين نبايد بچه\u200Cها را در منزل محدود كنند بلكه بايد آنها را آزاد بگذارند تا تمام لوازم اطراف خود را دستكاري كنند.",
    "هرگاه بچه\u200Cها برخلاف ميل والدين رفتار كردند والدين بايد به\u200Cجاي تنبيه آنها را راهنمايي كنند.",
    "والدين خيلي زود بايد به بچه\u200Cها بفهمانند كه رئيس خانواده چه كسي است.",
    "عبارات",
    "والدين بايد در تصميم\u200Cگيري\u200Cهاي مربوط به خانواده فقط آنچه را كه خواست بچه\u200Cها است، انجام دهند.",
    "اگر والدين رفتار و خواسته\u200Cهاي بچه\u200Cها را محدود نكنند، بيشتر مشكلات حل مي\u200Cشود.",
    "والدين بايد هنگام تصميم\u200Cگيري در مورد مسائل و برنامه\u200Cهاي خانواده نظر بچه\u200Cها را دخالت دهند و از آنها نيز نظرخواهي كنند.",
    "والدين بايد با بچه\u200Cهايي كه با نظر آنها مخالفت مي\u200Cكنند به شدت برخورد نمايند.",
    "والدين بايد به بچه\u200Cها اجازه دهند تا در كارها خودشان تصميم\u200Cگيرنده باشند.",
    "شوخي و بازي كردن بچه\u200Cها در حضور والدين توهين به آنها است.",
    "بچه\u200Cها به بازي و تفريح نياز دارند، براي اين كار والدين بايد به آنها اجازه دهند هر وقت دلشان خواست از منزل خارج شوند.",
    "بايد به بچه\u200Cها اجازه داده شود كه اگر فكر مي\u200Cكنند نظرشان از نظرات والدين خود بهتر است آن را ابراز كنند.",
    "وقتي بچه\u200Cها مرتكب اشتباهي مي\u200Cشوند هيچ\u200Cگاه نبايد آنها را سرزنش كرد.",
    "اگر والدين تصميمي برخلاف ميل بچه\u200Cها گرفتند در چنين مواردي بايد با بچه\u200Cها گفتگو كنند و حتي اگر اشتباه كرده بودند آن را بپذيرند.",
    "گاهي اوقات والدين بايد با بچه\u200Cها سازش كنند، نه اين\u200Cكه هميشه انتظار داشته باشند كه بچه\u200Cها با آنها سازش كنند.",
    "بايد اجازه داد تا بچه\u200Cها خودشان تجربه كنند.",
    "بعضي از بچه\u200Cها ذاتاً بد هستند و بايد طوري تربيت شوند كه از والدين خود بترسند.",
    "بچه\u200Cها وقتي بزرگ شوند از سخت\u200Cگيري\u200Cهاي والدين خود سپاسگذاري خواهند كرد.",
    "وقتي بچه\u200Cها دچار مشكل و دردسري شوند (كارخطايي انجام \u200Cدهند) بايد بدانند كه با مطرح كردن آن مشكل براي والدين خود تنبيه نمي\u200Cشوند.",
    "در مجالس و مهماني\u200Cها بايد بچه\u200Cها را آزاد گذاشت تا محيط اطراف خود را دستكاري كنند تا حس كنجكاوي آنها ارضا شود.",
    "بچه\u200Cها جدي و كوشا نخواهند بود مگر اين\u200Cكه درباره كارهاي آنها سخت\u200Cگيري كنيم.",
    "اگر چه بچه\u200Cها تجربه كمي دارند اما گاهي اوقات نظر آنها بهتر از نظر والدين است."
)


fun getQuiz3Result(answerList: ArrayList<Answer>): String {
    var firstScore = 0f
    var secondScore = 0f
    var thirdScore = 0f
    answerList.forEachIndexed { index, answer ->
        val questionNum = index + 1
        when {
            first.contains(questionNum) -> {
                firstScore += answer.answer
            }
            second.contains(questionNum) -> {
                secondScore += answer.answer
            }
            third.contains(questionNum) -> {
                thirdScore += answer.answer
            }
        }
    }
    firstScore /= first.size
    secondScore /= second.size
    thirdScore /= third.size
    var result = ""
    result += if (firstScore >= 2.1) {
        "شما سهل گیر هستید! \n"
    } else {
        "شما سهل گیر نیستید! \n"
    }
    result += if (secondScore >= 1.8) {
        "شما مستبد هستید! \n"
    } else {
        "شما مستبد نیستید! \n"
    }
    result += if (thirdScore >= 2.1) {
        "شما قاطع هستید! \n"
    } else {
        "شما قاطع نیستید! \n"
    }
    return result
}

private val first = arrayListOf(1, 6, 10, 13, 14, 17, 19, 24, 28, 29) // آزاد گذاری
private val second = arrayListOf(2, 3, 7, 9, 12, 16, 18, 21, 25, 26) //2. استبدادی
private val third = arrayListOf(4, 5, 8, 11, 15, 20, 22, 23, 27, 30)// 3.	قاطع و اطمینان بخش