package com.mhmdreza.azmoonyar.data.quizes

import android.text.Spannable
import android.text.SpannableStringBuilder
import androidx.core.text.bold
import androidx.core.text.toSpannable
import com.mhmdreza.azmoonyar.data.Answer
import com.mhmdreza.azmoonyar.data.AnswerType
import com.mhmdreza.azmoonyar.data.Question
import com.mhmdreza.azmoonyar.data.Quiz

const val TRADEOFF = "tradeoff"


fun getQuiz9(): Quiz {
    val quiz = Quiz(
        8,
        "راهنمای مقياس فرزندپروري آرنولد",
        getDescription(),
        AnswerType.TRADE_OFF,
        price = 5000
    )
    questions9.forEachIndexed { index, arnoldModel ->
        quiz.questions.add(
            Question(
                index + 1,
                arnoldModel.title,
                arrayListOf(TRADEOFF, arnoldModel.startRange, arnoldModel.endRange)
            )
        )
    }
    return quiz
}

private fun getDescription(): Spannable {
    return SpannableStringBuilder()
        .bold { append("\n\nمعرفی\n") }
        .append(
            "\n" +
                    "این پرسشنامه 30 ماده\u200Cاي توسط آرنولد و همكاران (1993) طراحي شده و با پاسخ به آن، بهترين توصيف از شيوه فرزندپروري در طي دو ماه گذشته به\u200Cصورت خودسنجي و توسط خود والدين به\u200Cدست مي\u200Cآيد. اين پرسشنامه سه الگوي انضباطي ناكارآمد والدين را مي\u200Cسنجد. \n"
        )
        .bold { append("والدين گرامي: با سلام\n") }
        .append(
            "معمولاً شما روش\u200Cهاي متفاوتي براي برخورد با مشكلات پيش مي\u200Cگيريد. در متن زير عباراتي است كه برخي  از روش\u200Cهاي فرزندپروري را توصيف مي\u200Cكند. براي هر عبارت يك مقياس 7 درجه\u200Cاي آمده كه در دو طرف آن دو نمونه رفتار توصيف شده است كه معمولاً در نقطه مقابل يكديگر هستند. مثلاً در مورد مثال زير يعني \"هنگام صرف غذا \" در سمت راست نوشته شده است كه \" مي\u200C\u200Cگذارم كودكم تصميم بگيرد چقدر بخورد.\" و در سمت چپ دقيقاً رفتار متضاد آن آمده است. يعني \"من تصميم مي\u200Cگيرم كودكم چقدر بخورد.\" اگر روش شما هميشه و دقيقاً مطابق جمله سمت راست است در جدول علامت بزنيد، اگر اكثر اوقات روش جمله سمت راست را استفاده مي\u200Cكنيد ولي نه هميشه، در عدد 2 را علامت بزنيد. اما اگر روش شما هميشه و دقيقاً مطابق جمله سمت چپ است، عدد 7 را علامت بزنيد و در صورتي كه اكثر اوقات چنين است، عدد 6 را علامت بزنيد. اگر گاهي از اين روش و گاهي از آن روش استفاده مي\u200Cكنيد، بر اساس اين\u200Cكه بيشتر به كدام روش متمايل است در اعداد 3، 4، يا 5 را انتخاب كنيد. لطفاً\u200C جملات زير را بخوانيد و در مورد هر جمله، عددي كه بهتر از همه روش فرزندپروري شما را در طي دو ماه گذشته توصيف مي\u200Cكند، را علامت بزنيد."
        )
        .append("\n\n")
        .toSpannable()
}


val questions9 = arrayListOf(
    ArnoldModel(
        "وقتي كودكم بد رفتاري مي\u200Cكند....",
        "بلافاصله واكنش نشان مي\u200Cدهم.",
        "صبر مي\u200Cكنم و بعداً واكنش نشان مي\u200Cدهم."
    ),
    ArnoldModel(
        "قبل از آن كه با مشكلي برخورد كنم .....",
        "چند بار به كودكم تذكر يا هشدار مي\u200Cدهم.   ",
        "تنها از يك بار تذكر يا هشدار استفاده مي\u200Cكنم."
    ),
    ArnoldModel(
        "وقتي عصبي يا تحت فشار هستم.....",
        "ايرادگير مي\u200Cشوم و به كودكم گير مي\u200Cدهم.",
        "بيشتر از حد معمول ايراد نمي\u200Cگيرم."
    ),
    ArnoldModel(
        "وقتي به كودكم مي\u200Cگويم كاري را انجام ندهد.....",
        "يك يا دو بار مي\u200Cگويم",
        "چند بار مي\u200Cگويم."
    ),
    ArnoldModel(
        "وقتي كودكم مرا ذله مي\u200Cكند ......",
        "مي\u200Cتوانم اين رفتار را ناديده بگيرم.",
        "نمي\u200Cتوانم اين رفتار را ناديده بگيرم."
    ),

    ArnoldModel(
        "وقتي كودكم بدرفتاري مي\u200Cكند..... ",
        "معمولاً وارد يك مشاجره طولاني با او مي\u200Cشوم.",
        "با او مشاجره نمي\u200Cكنم."
    ),
    ArnoldModel(
        "به انجام كاري تهديد مي\u200Cكنم كه......",
        "مطمئنم مي\u200Cتوانم انجام دهم.",
        "مي\u200Cدانم عملاً انجام نخواهم داد."
    ),
    ArnoldModel(
        "من از آن دسته والديني هستم كه در مورد آن چه كودكم اجازه دارد انجام دهد،",
        "مي\u200Cگذارم كودكم هر كاري كه مي\u200Cخواهد، انجام دهد.",
        "محدودیت می\u200Cگذارم."
    ),
    ArnoldModel(
        "وقتي كودكم بدرفتاري مي\u200Cكند......",
        "با او مفصلاً در مورد رفتارش صحبت مي\u200Cكنم.",
        " صحبتم را كوتاه مي\u200Cكنم و به مسأله اصلي اشاره مي\u200Cكنم."
    ),
    ArnoldModel(
        "وقتي كودكم بد رفتاري مي\u200Cكند ......",
        "صدايم را بلند مي\u200Cكنم يا فرياد مي\u200Cزنم.",
        "به آرامي با كودكم صحبت مي\u200Cكنم."
    ),

    ArnoldModel(
        "اگر گفتن نه همان موقع مؤثر نباشد.....",
        "كار ديگري را پيش مي\u200Cگيرم.",
        "صحبتم را ادامه مي\u200Cدهم تا وقتي كه حرفم را در كله\u200Cاش فرو كنم."
    ),
    ArnoldModel(
        "وقتي بخواهم كودكم انجام كاري را متوقف نمايد......",
        " با لحن محكم به كودكم مي\u200Cگويم ديگر كافي است.",
        "با چرب\u200Cزباني سعي مي\u200Cكنم دل او را به دست آورم يا خواهش و تمنا مي\u200C\u200Cكنم كه بس كند."
    ),
    ArnoldModel(
        "وقتي كودكم خارج از ديد من است .......",
        " اغلب نمي\u200Cدانم كودكم در حال انجام چه كاري است.",
        "هميشه به خوبي حدس مي\u200Cزنم كه چه كاري مي\u200Cكند."
    ),
    ArnoldModel(
        "بعد از اين كه با كودكم مشكل داشته\u200Cام.......",
        "غالباً كينه را نگه مي\u200Cدارم.",
        "همه چيز سريع به حال عادي بر مي\u200Cگردد."
    ),
    ArnoldModel(
        "وقتي در خانه نيستيم......",
        "با كودكم مثل وقتي كه در خانه هستيم رفتار مي\u200Cكنم.",
        "  خيلي بيشتر به او اجازه مي\u200Cدهم تا كارهايي را كه  "
    ),

    ArnoldModel(
        "وقتي كودكم كاري را انجام مي\u200Cدهد كه دوست ندارم......",
        "هر بار كه اتفاق مي\u200Cافتد واكنش نشان مي\u200Cدهم.",
        "غالباً به روي خودم نمي\u200Cآورم."
    ),
    ArnoldModel(
        "وقتي با كودكم مشكل دارم.......",
        "شرايط از كنترلم خارج شده و من كارهايي مي\u200Cكنم  كه واقعاً دلم نمي\u200Cخواهد انجام دهم.",
        "چيزي از كنترلم خارج نمي\u200Cشود."
    ),
    ArnoldModel(
        "وقتي كودكم بدرفتاري مي\u200Cكند به پشت باسنش مي\u200Cزنم، به پشت دستش مي\u200Cزنم، هلش مي\u200Cدهم يا كتكش مي\u200Cزنم.......",
        "هرگز به ندرت", "اكثر اوقات"
    ),
    ArnoldModel(
        "وقتي كودكم كاري را كه خواسته\u200Cام انجام نمي\u200Cدهد...... ",
        "اغلب به روي خودم نمي\u200Cآورم يا بالاخره خودم آن كار را انجام مي\u200Cدهم.",
        " كار ديگري انجام مي\u200Cدهم."
    ),
    ArnoldModel(
        "وقتي تهديد يا هشدار مناسب و بجايي مي\u200Cدهم ......",
        "غالباً به آن عمل نمي\u200Cكنم.",
        "هميشه آن چه را گفته\u200Cام انجام مي\u200Cدهم."
    ),

    ArnoldModel(
        "اگر گفتن \"نه\"  ميسر نباشد......",
        "كار ديگري انجام مي\u200Cدهم. ",
        "جايزه جالبي را به كودكم پيشنهاد مي\u200Cكنم تا آن كار را انجام دهد."
    ),
    ArnoldModel(
        "وقتي كودكم بدرفتاري مي\u200Cكند...... ",
        "بدون اين\u200Cكه عصبي شوم با او برخورد مي\u200Cكنم.",
        "آن قدر آزرده و عصبي مي\u200Cشوم كه كودكم متوجه مي\u200Cشود كه عصبي هستم."
    ),
    ArnoldModel(
        "وقتي كودكم بدرفتاري مي\u200Cكند......",
        "كودكم را وادار مي\u200Cكنم بگويد كه چرا اين كار را انجام داده است.",
        "مي\u200Cگويم \"نه\" يا كار ديگري مي\u200Cكنم."
    ),
    ArnoldModel(
        "اگر كودكم بدرفتاري كند و سپس معذرت\u200Cخواهي كند.......",
        "مثل هميشه با مشكل برخورد مي\u200Cكنم.", "اين بار برخوردي نمي\u200Cكنم. "
    ),
    ArnoldModel(
        "وقتي كودكم بدرفتاري مي\u200Cكند......",
        "به ندرت از بدزباني يا نفرين استفاده مي\u200Cكنم.",
        "تقريباً هميشه بدزباني مي\u200Cكنم."
    ),

    ArnoldModel(
        "وقتي به كودكم مي\u200Cگويم اجازه ندارد كاري را انجام دهد.......",
        "به هر حال مي\u200Cگذارم آن كار را انجام دهد.", "سرحرفم مي\u200Cايستم."
    ),
    ArnoldModel(
        "وقتي بايد با مشكلي برخورد كنم.......",
        "به كودكم مي\u200Cگويم از اين بابت متأسفم.", "مي\u200Cگويم متأسفم."
    ),
    ArnoldModel(
        "وقتي كودكم كاري را انجام مي\u200Cدهد كه دوست ندارم، به كودكم توهين مي\u200Cكنم، حرف\u200Cهايي مي\u200Cزنم كه او را برنجاند يا به او فحش\u200C مي\u200Cدهم......",
        "هرگز يا به ندرت", "اكثر اوقات"
    ),
    ArnoldModel(
        "اگر وقتي با مشكلي برخورد مي\u200Cكنم كودكم حاضر جوابي يا شكايت كند.......",
        "شكايتش را ناديده گرفته و سرحرفم مي\u200Cايستم.",
        "با كودكم صحبت مي\u200Cكنم كه نبايد شكايت كند."
    ),
    ArnoldModel(
        "اگر كودكم وقتي كه مي\u200Cگويم \"نه\" عصبي شود.......",
        "حرفم را پس مي\u200Cگيرم و تسليم كودكم مي\u200Cشوم.", "سر حرفم مي\u200Cايستم."
    )
)


class ArnoldModel(val title: String, val startRange: String, val endRange: String)


fun getQuiz9Result(answerList: ArrayList<Answer>): String {
    var firstScore = 0f
    var secondScore = 0f
    var thirdScore = 0f
    answerList.forEachIndexed { index, answer ->
        val questionNum = index + 1
        when {
            first.contains(questionNum) -> {
                firstScore += answer.answer
            }
            second.contains(questionNum) -> {
                secondScore += answer.answer
            }
            third.contains(questionNum) -> {
                thirdScore += answer.answer
            }
        }
    }
    firstScore /= first.size
    secondScore /= second.size
    thirdScore /= third.size
    var result = ""
    result += if (firstScore >= 3) {
        "رفتار افراطی در اهمال کاری\n"
    } else {
        "رفتار مناسب در اهمال کاری\n"
    }
    result += if (secondScore >= 3) {
        "رفتار افراطی در واکنش بیش از حد\n"
    } else {
        "رفتار مناسب در واکنش بیش از حد\n"
    }
    result += if (thirdScore >= 3) {
        "رفتار افراطی در پرگویی در کلام\n"
    } else {
        "رفتار مناسب در پرگویی در کلام\n"
    }
    return result
}

private val first = arrayListOf(7, 8, 12, 15, 16, 19, 20, 21, 24, 26, 30) //1.	اهمال کاری
private val second = arrayListOf(3, 6, 9, 10, 14, 17, 18, 22, 25, 28) //2.	واکنش بیش از حد
private val third = arrayListOf(2, 4, 7, 9, 11, 23, 29)// 3.	پرگویی در کلام