package com.mhmdreza.azmoonyar.data.quizes

import com.mhmdreza.azmoonyar.data.AnswerType
import com.mhmdreza.azmoonyar.data.Question
import com.mhmdreza.azmoonyar.data.Quiz

fun getQuiz1(): Quiz{
    val quiz = Quiz(1,
        "راهنمای مقیاس روشهای فرزند پروری",
        "desc1", AnswerType.AGREEMENT_LEVEL_4)
    questions1.forEachIndexed { index, s ->
        quiz.questions.add(Question(index + 1, s))
    }
    return quiz
}

val questions1 = arrayListOf(
    "والدین باید زمانی را در کنار کودکان باشند تا لذت در کنار هم بودن را تجربه کنند.",
    "والدین باید محبت خود به کودکان را به طور کلامی ابراز کنند.",
    "والدین باید دلیل کارهای خود در خانه را توضیح دهند و ریشه مشکلات را شناسایی کنند.",
    "والدین باید روش صحیح آداب و احترام به بزرگتر  را به فرزندان یاد دهند.",
    "توقع والدین از کودکان باید در حد توان و درک آن\u200Cها باشد.",

    "بچه\u200Cها نباید هیچ مخالفتی نسبت خواسته پدر و مادر داشته باشند.",
    "والدین باید اجازه دهند کودکان کنجکاوی کنند و هر چه را که در جهت افزایش کارایی مثبت کودک مورد نیاز است فراهم نمایند.",
    "والدین باید با تقویت نیروی ایمان و الگو بودن، گودکان را آموزش و مشاوره دهند و هدایت نمایند.",
    "با کودکان باید با زبان خود آن\u200Cها سخن گفت و دلایل منطقی بعضی از مخالفت\u200Cها را بیان کرد.",
    "والدین باید در تصمیم\u200Cگیری\u200Cها آن\u200Cچه صلاح خانواده است انجام دهند.",

    "اگر والدین وقت و فرصت کافی برای گوش کردن به صحبت کودکان داشته باشند مشکلات کمتر می\u200Cشود.",
    "والدین باید به نظرات فرزندان گوش دهند و در صورت مفید بودن از آن هم استفاده کنند.",
    "والدین می\u200Cتوانند با نظرات غیر اصولی و غیر اخلاقی کودکان مخالفت کنند.",
    "والدین باید با بچه\u200Cها اجازه دهند تا در تصمیم\u200Cگیری\u200Cها نقش داشته باشند تا معنای مشورت را بدانند. 1",
    "شوخی و بازی غیر اخلاقی بچه\u200Cها در حضور والدین صحیح نیست.",

    "والدین در مواقعی باید کودکان را نوازش کرده و در آغوش بگیرند.",
    "بچه\u200Cها باید جرأت بیان عقاید و اظهار نظر در حضور والدین داشته باشند.",
    "کودکان اذیت کار باید به\u200Cطور غیر مستقیم بیاموزند و از بزرگ\u200Cترها حساب ببرند و دلایل منطقی را بدانند.",
    "کودکان باید اجازه داشته باشند مشکلات خود را با والدین مطرح کنند و والدین باید صبور باشند.",
    "اگر بچه\u200Cها را زیر نظر نداشته باشیم و تذکرات توأم با نصیحت به موقع ندهیم تلاش نمی\u200Cکنند و پیشرفت نخواهند کرد."
)