package com.mhmdreza.azmoonyar.data.quizes

import android.text.Spannable
import android.text.SpannableStringBuilder
import androidx.core.text.bold
import androidx.core.text.toSpannable
import com.mhmdreza.azmoonyar.data.Answer
import com.mhmdreza.azmoonyar.data.AnswerType
import com.mhmdreza.azmoonyar.data.Question
import com.mhmdreza.azmoonyar.data.Quiz

fun getQuiz5(): Quiz {
    val quiz = Quiz(
        4,
        "پرسشنامه فرزندپروری آلاباما (فرم كودكان)",
        getDescription(),
        AnswerType.FREQUENCY_LEVEL
    )
    questions5.forEachIndexed { index, s ->
        quiz.questions.add(Question(index + 1, s))
    }
    return quiz
}
private fun getDescription(): Spannable {
    return SpannableStringBuilder()
        .bold { append( "\n\nمعرفی\n") }
        .append(
            "اين پرسشنامه يك ابزار خودگزارشي و داراي 42 عبارت است كه پنج بعد رفتار فرزندپروری که عبارتند از مشاركت والدين (پدر و مادر به طور جداگانه)، فرزندپروری مثبت، ضعف در نظارت و راهنمايي، عدم ثبات در نحوه برخورد با فرزند و تنبيه بدني را مورد ارزيابي قرار مي\u200Fدهد. لازم به ذكر است كه عبارات مربوط به زيرمقياس مشاركت والدين هر كدام از دو بخش تشكيل شده، كه يك بخش مربوط به مشاركت مادر و ديگري مربوط به مشاركت پدر است. \n" +
                    "در ادامه، تعدادی جمله در مورد خانواده\u200Cتان آمده است. لطفاً بر حسب اینکه هر مورد معمولاً چقدر در خانه\u200Cتان اتفاق می\u200Cافتد به آن\u200Cها امتیاز دهید. پاسخ\u200Cهایی که می\u200Cتوانید از آن\u200Cها استفاده کنید عبارتند از:\n" +
                    "هرگز (1)، تقریباً هیچ وقت (2)، گاهی اوقات (3)، اغلب اوقات (4)، همیشه (5). لطفاً به همه موارد پاسخ بدهید.\n"
        )
        .append("\n\n")
        .toSpannable()
}


val questions5 = arrayListOf(
    "با مادرتان صحبت\u200Fهاي دوستانه\u200Fاي داريد.",
    "با پدرتان صحبت\u200Fهاي دوستانه\u200Fاي داريد.",
    "زماني كه كار خوبي انجام مي\u200Fدهيد، والدينتان شما را متوجه آن كار خوب مي\u200Fكنند.",
    "والدينتان شما را تهديد به تنبيه مي\u200Fكنند، اما بعداً تنبيه\u200Cتان نمي\u200Fكنند.",
    "مادرتان داوطلب كمك به فعاليت\u200Fهاي خاصي كه شما درگير آن هستيد مي\u200Fشود (مثلاً بازي، ورزش، فعاليت\u200Fهاي گروه\u200Fهاي مذهبي و ...).",
    "پدرتان داوطلب كمك به فعاليت\u200Fهاي خاصي كه شما درگير آن هستيد مي\u200Fشود (مثلاً بازي، ورزش، فعاليت\u200Fهاي گروه\u200Fهاي مذهبي و ...).",
    "والدينتان رفتار خوب شما را با جايزه يا پاداش مورد تشويق قرار مي\u200Fدهند.",
    "اگر شما بخواهيد جايي برويد براي والدينتان يادداشت نمي\u200Fگذاريد تا بدانند كه كجا رفته\u200Fايد.",
    "با مادرتان به بازي و تفريح مي\u200Fپردازيد.",
    "با پدرتان به بازي و تفريح مي\u200Fپردازيد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد بدون آنكه تنبيه شويد، با والدينتان صحبت مي\u200Fكنيد.",
    "مادرتان در مورد فعاليت\u200Fهاي روزانه شما در مدرسه پرس و جو مي\u200Fكند.",
    "پدرتان در مورد فعاليت\u200Fهاي روزانه شما در مدرسه پرس و جو مي\u200Fكند.",
    "غروب، پس از زماني كه انتظار مي\u200Fرود در خانه باشيد، بيرون مي\u200Fمانيد.",
    "مادرتان در انجام تكاليف مدرسه به شما كمك مي\u200Fكند.",
    "پدرتان در انجام تكاليف مدرسه به شما كمك مي\u200Fكند.",
    "تلاش والدينتان براي وادار كردن شما به انجام كارها بيهوده است چون آن\u200Cها مي\u200Fدانند اين كار برايشان دشوار است.",
    "وقتي كار خوبي انجام مي\u200Fدهيد، والدينتان شما را تحسين مي\u200Fكنند.",
    "مادرتان از شما در مورد برنامه\u200Fاي كه براي فرداي آن روز داريد، پرس و جو مي\u200Fكند.",
    "پدرتان از شما در مورد برنامه\u200Fاي كه براي فرداي آن روز داريد، پرس و جو مي\u200Fكند.",
    "مادرتان شما را به انجام كارهاي خاصي وادار مي\u200Fكند.",
    "پدرتان شما را به انجام كارهاي خاصي وادار مي\u200Fكند.",
    "به خاطر رفتار خوبي كه داشته\u200Fايد، والدينتان به شما جايزه مي\u200Fدهند.",
    "والدينتان دوستان (آنهايي كه با شما هستند) شما را نمي\u200Fشناسند.",
    "وقتي كار خوبي انجام مي\u200Fدهيد، والدينتان شما را به آغوش مي\u200Fكشند يا مي\u200Fبوسند.",
    "بدون آنكه ساعت بازگشت خود را مشخص كنيد از خانه خارج مي\u200Fشويد.",
    "مادرتان درباره دوستانتان با شما صحبت مي\u200Fكند.",
    "پدرتان درباره دوستانتان با شما صحبت مي\u200Fكند.",
    "پس از تاریک شدن هوا، بدون همراهی پدر یا مادرتان بیرون می\u200Cروید.",
    "والدينتان زودتر از موعد مقرر تنبيه شما را قطع مي\u200Fكنند (مثلاً برداشتن محدوديت، زودتر از آنچه اول گفته\u200Fاند).",
    "شما در برنامه\u200Fريزي فعاليت\u200Fهاي خانوادگي كمك مي\u200Fكنيد.",
    "والدينتان آنقدر مشغول مي\u200Fشوند كه فراموش مي\u200Fكنند شما كجاييد و چه مي\u200Fكنيد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد، والدينتان تنبيه\u200Cتان نمي\u200Fكنند.",
    "مادرتان در جلسات اوليا و مربيان، يا ديگر جلسات مدرسه شركت مي\u200Fكند.",
    "پدرتان در جلسات اوليا و مربيان، يا ديگر جلسات مدرسه شركت مي\u200Fكند.",
    "وقتي در امور خانه كمك مي\u200Fكنيد، والدينتان به شما مي\u200Fگويند كه از كار شما خشنود شده\u200Fاند.",
    "وقتي شما دير به خانه مي\u200Fآيد، والدينتان متوجه دير آمدن شما نمي\u200Fشوند.",
    "والدينتان بدون اينكه به شما بگويند به كجا مي\u200Fروند، خانه را ترك مي\u200Fكنند.",
    "شما با بيش از يك ساعت تأخير از زمان تعيين شده\u200Fاي كه والدينتان منتظرتان هستند، از مدرسه به خانه مي\u200Fآييد.",
    "شكل و نوع تنبيهي كه والدينتان براي شما به كار مي\u200Fبرند، به وضعيت روحيشان بستگي دارد.",
    "شما بدون اينكه بزرگتري با شما باشد، در خانه تنهاييد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد، والدينتان با دست محكم به پشت شما مي\u200Fزنند.",
    "وقتي رفتار اشتباهي انجام مي\u200Fدهيد، مورد بي\u200Fاعتنايي والدينتان قرار مي\u200Fگيريد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد، والدينتان به شما سيلي مي\u200Fزنند.",
    "والدينتان امتيازات يا پولي را كه به شما داده\u200Fاند، به عنوان تنبيه از شما پس مي\u200Fگيرند.",
    "والدينتان براي تنبيه، شما را به اتاقتان مي\u200Fفرستند.",
    "وقتي شما كار اشتباهي انجام مي\u200Fدهيد، والدينتان شما را با كمربند، دسته كليد يا اشيای ديگر مي\u200Fزنند.",
    "وقتي شما كار اشتباهي انجام مي\u200Fدهيد، والدينتان سرتان داد و فرياد مي\u200Fكنند.",
    "هنگامي كه شما بدرفتاري مي\u200Fكنيد، والدينتان با خونسردي توضيح مي\u200Fدهند كه چرا رفتارتان اشتباه بوده است.",
    "والدينتان براي تنبيه شما از روش محروم كردن استفاده مي\u200Fكنند (مثلاً براي مدتي شما را از انجام فعاليت\u200Fهاي مورد علاقه\u200Fتان منع مي\u200Fكنند).",
    "والدينتان به عنوان تنبيه شما را وادار به انجام كارهاي سخت مي\u200Fكنند."
)

fun getQuiz5Result(answerList: ArrayList<Answer>): String {
    var firstScore = 0f
    var secondScore = 0f
    var thirdScore = 0f
    var fourthScore = 0f
    var fifthScore = 0f
    var fatherScore = 0f
    answerList.forEachIndexed { index, answer ->
        val questionNum = index + 1
        when {
            first.contains(questionNum) -> {
                firstScore += answer.answer
            }
            second.contains(questionNum) -> {
                secondScore += answer.answer
            }
            third.contains(questionNum) -> {
                thirdScore += answer.answer
            }
            fourth.contains(questionNum) -> {
                fourthScore += answer.answer
            }
            fifth.contains(questionNum) -> {
                fifthScore += answer.answer
            }
            father.contains(questionNum) -> {
                fatherScore += answer.answer
            }
        }
    }
    firstScore /= first.size
    secondScore /= second.size
    thirdScore /= third.size
    fourthScore /= fourth.size
    fifthScore /= fifth.size
    fatherScore /= father.size
    var result = ""
    result += if (firstScore >= 4) {
        "مشارکت مناسب مادر\n"
    } else {
        "مشارکت نامناسب مادر\n"
    }
    result += if (fatherScore >= 4) {
        "مشارکت مناسب پدر\n"
    } else {
        "مشارکت نامناسب پدر\n"
    }
    result += if (secondScore >= 2.4) {
        "فرزندپروری مثبت\n"
    } else {
        "فرزندپروری منفی\n"
    }
    result += if (thirdScore >= 2.4) {
        "عدم ثبات در نحوه برخورد با فرزند\n"
    } else {
        " ثبات در نحوه برخورد با فرزند\n"
    }
    result += if (fourthScore >= 4) {
        "ضعف در نظارت و راهنمايي مناسب \n"
    } else {
        "عدم ضعف در نظارت و راهنمايي مناسب \n"
    }
    result += if (fifthScore >= 1.2) {
        "بکاربردن تنبيه بدني\n"
    } else {
        "بکارنبردن تنبيه بدني\n"
    }
    return result
}

private val first = arrayListOf(1, 5, 9, 12, 15, 19, 21, 27, 31, 35) //1.	مشاركت والدين
private val father = arrayListOf(2, 6, 10, 13, 16, 20, 22, 28, 32, 36) //1.	مشاركت والدين
private val second = arrayListOf(3, 7, 18, 23, 25, 37) //2.	فرزندپروری مثبت:
private val third = arrayListOf(4, 11, 17, 30, 34, 41)// 3.	عدم ثبات در نحوه برخورد با فرزند:
private val fourth = arrayListOf(8, 14, 24, 26, 29, 33, 38, 39, 40, 42)// 4.	ضعف در نظارت و راهنمايي:
private val fifth = arrayListOf(43, 45, 49)// تنبیه بدنی
