package com.mhmdreza.azmoonyar.data.quizes

import android.text.Spannable
import android.text.SpannableStringBuilder
import androidx.core.text.bold
import androidx.core.text.toSpannable
import com.mhmdreza.azmoonyar.data.Answer
import com.mhmdreza.azmoonyar.data.AnswerType
import com.mhmdreza.azmoonyar.data.Question
import com.mhmdreza.azmoonyar.data.Quiz

fun getQuiz4(): Quiz {
    val quiz = Quiz(
        3,
        "پرسشنامه فرزندپروری آلاباما (فرم والدين)",
        getDescription(),
        AnswerType.FREQUENCY_LEVEL
    )
    questions4.forEachIndexed { index, s ->
        quiz.questions.add(Question(index + 1, s))
    }
    return quiz
}

private fun getDescription(): Spannable {
    return SpannableStringBuilder()
        .bold { append("\n\nمعرفی\n") }
        .append(
            "اين پرسشنامه يك ابزار خودگزارشي و داراي 42 عبارت است كه پنج بعد رفتار فرزندپروری: مشاركت والدين، فرزندپروری مثبت، ضعف در نظارت و راهنمايي، عدم ثبات در نحوه برخورد با فرزند و تنبيه بدني را مورد ارزيابي قرار مي\u200Cدهد. \n"
        )
        .bold { append("شيوه نمره\u200Cگذاري \n") }
        .append(
            "آزمودني (يكي از والدين) در فرم والدين بايد در يك مقياس ليكرت 5 درجه\u200Cاي (از هرگز =1 تا هميشه =5) مشخص سازد كه هر يك از عبارات تا چه حد در مورد تعامل وي با فرزندش صدق مي\u200Cكند. اين مقياس براي والديني كه فرزندشان بين 8 تا 16 سال سن دارد، مناسب است. \n" +
                    "در ادامه، تعدادی جمله در مورد خانواده\u200Cتان آمده است. لطفاً بر حسب اینکه هر مورد معمولاً چقدر در خانه\u200Cتان اتفاق می\u200Cافتد به آن\u200Cها امتیاز دهید. پاسخ\u200Cهایی که می\u200Cتوانید از آن\u200Cها استفاده کنید عبارتند از:\n" +
                    "هرگز (1)، تقریباً هیچ وقت (2)، گاهی اوقات (3)، اغلب اوقات (4)، همیشه (5). لطفاً به همه موارد پاسخ بدهید.\n"
        )
        .append("\n\n")
        .toSpannable()
}

val questions4 = arrayListOf(
    "با فرزندتان صحبت\u200Cهاي دوستانه\u200Cاي داريد.",
    "زماني كه فرزندتان كار خوبي انجام مي\u200Cدهد، شما او را متوجه آن كار خوب مي\u200Cكنيد.",
    "فرزندتان را تهديد به تنبيه مي\u200Cكنيد، اما بعداً تنبيهش نمي\u200Cكنيد.",
    "داوطلب كمك به فعاليت\u200Cهاي خاصي كه فرزندتان درگير آن است، مي\u200Cشويد (مثلاً بازي، ورزش، فعاليت\u200Cهاي گروه\u200Cهاي مذهبي و ...).",
    "رفتار خوب فرزندتان را با جايزه يا پاداش مورد تشويق قرار مي\u200Cدهيد.",
    "اگر فرزندتان بخواهد جايي برود براي شما يادداشت نمي\u200Cگذارد تا بدانيد كه كجا رفته است.",
    "با فرزندتان به بازي و تفريح مي\u200Cپردازيد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد بدون آنكه تنبيه شود، با او صحبت مي\u200Cكنيد.",
    "در مورد فعاليت\u200Cهاي روزانه فرزندتان در مدرسه پرس و جو مي\u200Cكنيد.",
    "فرزندتان غروب، پس از زماني كه انتظار مي\u200Cرود در خانه باشد، بيرون مي\u200Cماند.",
    "در انجام تكاليف مدرسه به فرزندتان كمك مي\u200Cكنيد.",
    "تلاش شما براي وادار كردن فرزندتان به انجام كارها بيهوده است چون اين كار برايتان دشوار است.",
    "وقتي فرزندتان كار خوبي انجام مي\u200Cدهد، شما او را تحسين مي\u200Cكنيد.",
    "از فرزندتان در مورد برنامه\u200Cاي كه براي فرداي آن روز دارد، پرس و جو مي\u200Cكنيد.",
    "فرزندتان را به انجام كارهاي خاصي وادار مي\u200Cكنيد.",
    "به خاطر رفتار خوبي كه فرزندتان داشته است، به او جايزه مي\u200Cدهيد.",
    "دوستان فرزندتان (آن\u200Cهايي كه با او هستند) را نمي\u200Cشناسيد.",
    "وقتي فرزندتان كار خوبي انجام مي\u200Cدهد، وي را به آغوش مي\u200Cكشيد يا مي\u200Cبوسيد.",
    "فرزندتان بدون آنكه ساعت بازگشت خود را مشخص كند از خانه خارج مي\u200Cشود.",
    "فرزندتان درباره دوستانش با شما صحبت مي\u200Cكند.",
    "فرزندتان پس از تاریک شدن هوا، بدون همراهی شما بیرون می\u200Cرود.",
    "زودتر از موعد مقرر تنبيه فرزندتان را قطع مي\u200Cكنيد (مثلاً برداشتن محدوديت زودتر از آنچه، اول گفته\u200Cايد).",
    "فرزندتان در برنامه\u200Cريزي فعاليت\u200Cهاي خانوادگي كمك مي\u200Cكند.",
    "شما آنقدر مشغول مي\u200Cشويد كه فراموش مي\u200Cكنيد فرزندتان كجاست و چه مي\u200Cكند.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، تنبيهش نمي\u200Cكنيد.",
    "در جلسات اوليا و مربيان، يا ديگر جلسات مدرسه فرزندتان شركت مي\u200Cكنيد.",
    "وقتي فرزندتان در امور خانه كمك مي\u200Cكند، شما به او مي\u200Cگوييد كه از كارش خشنود شده\u200Cايد.",
    "وقتي فرزندتان دير به خانه مي\u200Cآيد، شما متوجه دير آمدن او نمي\u200Cشويد.",
    "بدون اينكه به فرزندتان بگوييد به كجا می\u200Cرويد، خانه را ترك مي\u200Cكنيد.",
    "فرزندتان با بيش از يك ساعت تأخير از زمان تعيين شده\u200Cاي كه شما منتظرش هستید، از مدرسه به خانه مي\u200Cآيد.",
    "شكل و نوع تنبيهي كه براي فرزندتان به كار مي\u200Cبريد، به وضعيت روحي\u200Cتان بستگي دارد.",
    "فرزندتان بدون اينكه بزرگتري با او باشد، در خانه تنهاست.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، با دست محكم به پشت او مي\u200Cزنيد.",
    "وقتي فرزندتان رفتار اشتباهي انجام مي\u200Cدهد، مورد بي\u200Cاعتنايي شما قرار مي\u200Cگيرد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، به او سيلي مي\u200Cزنيد.",
    "امتيازات يا پولي را كه به فرزندتان داده\u200Cايد، به عنوان تنبيه از او پس مي\u200Cگيريد.",
    "براي تنبيه، فرزندتان را به اتاقش مي\u200Cفرستيد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، شما او را با كمربند، دسته كليد يا اشيای ديگر مي\u200Cزنيد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، شما سرش داد و فرياد مي\u200Cكنيد.",
    "هنگامي كه فرزندتان بدرفتاري مي\u200Cكند، شما با خونسردي توضيخ مي\u200Cدهيد كه چرا رفتارش اشتباه بوده است.",
    "براي تنبيه فرزندتان از روش محروم كردن استفاده مي\u200Cكنيد (مثلاً براي مدتي او را از انجام فعاليت\u200Cهاي مورد علاقه\u200Cاش منع مي\u200Cكنيد).",
    "به عنوان تنبيه فرزندتان را وادار به انجام كارهاي سخت مي\u200Cكنيد."
)

fun getQuiz4Result(answerList: ArrayList<Answer>): String {
    var firstScore = 0f
    var secondScore = 0f
    var thirdScore = 0f
    var fourthScore = 0f
    var fifthScore = 0f
    answerList.forEachIndexed { index, answer ->
        val questionNum = index + 1
        when {
            first.contains(questionNum) -> {
                firstScore += answer.answer
            }
            second.contains(questionNum) -> {
                secondScore += answer.answer
            }
            third.contains(questionNum) -> {
                thirdScore += answer.answer
            }
            fourth.contains(questionNum) -> {
                fourthScore += answer.answer
            }
            fifth.contains(questionNum) -> {
                fifthScore += answer.answer
            }
        }
    }
    firstScore /= first.size
    secondScore /= second.size
    thirdScore /= third.size
    fourthScore /= fourth.size
    fifthScore /= fifth.size
    var result = ""
    result += if (firstScore >= 4) {
        "مشارکت مناسب والدین\n"
    } else {
        "مشارکت نامناسب والدین\n"
    }
    result += if (secondScore >= 2.4) {
        "فرزندپروری مثبت\n"
    } else {
        "فرزندپروری منفی\n"
    }
    result += if (thirdScore >= 2.4) {
        "عدم ثبات در نحوه برخورد با فرزند\n"
    } else {
        " ثبات در نحوه برخورد با فرزند\n"
    }
    result += if (fourthScore >= 4) {
        "ضعف در نظارت و راهنمايي مناسب \n"
    } else {
        "عدم ضعف در نظارت و راهنمايي مناسب \n"
    }
    result += if (fifthScore >= 1.2) {
        "بکاربردن تنبيه بدني\n"
    } else {
        "بکارنبردن تنبيه بدني\n"
    }
    return result
}

private val first = arrayListOf(1, 4, 7, 9, 11, 14, 15, 20, 23, 26) //1.	مشاركت والدين
private val second = arrayListOf(2, 5, 13, 16, 18, 27) //2.	فرزندپروری مثبت:
private val third = arrayListOf(3, 8, 12, 22, 25, 31)// 3.	عدم ثبات در نحوه برخورد با فرزند:
private val fourth =
    arrayListOf(6, 10, 17, 19, 21, 24, 28, 29, 30, 32)// 4.	ضعف در نظارت و راهنمايي:
private val fifth = arrayListOf(33, 35, 39)// تنبیه بدنی