package com.mhmdreza.azmoonyar.data.quizes

import com.mhmdreza.azmoonyar.data.*

enum class AnswerType {
    AGREEMENT_LEVEL_4,
    AGREEMENT_LEVEL_5,
    TRADE_OFF,
    PARENT_CHOICE,
    FREQUENCY_LEVEL,
}

data class FinalResult(
    val text: String,
    val targetQuestions: List<Int>,
    val description: String = "",
    val isGood: Boolean = true
)

enum class QuizType(
    val id: Int,
    val title: String,
    val answerType: AnswerType,
    val finalResults: List<FinalResult> = emptyList(),
    val price: Int = 0
) {
    QUIZ1(
        0,
        "مقیاس روشهای فرزند پروری",
        AnswerType.AGREEMENT_LEVEL_4,
        arrayListOf(
            FinalResult(
                "شما سهل گیر هستید!",
                arrayListOf(2, 7, 9, 12, 14, 16, 19),
                " اين والدين در زندگي فرزندان خود خيلي دخالت مي\u200Cكنند بدون آن\u200Cكه محدوديت و كنترل بر آن\u200Cها اعمال شود. آنان چندان توقع از فرزندان خود ندارند و اجازه مي\u200Cدهند كه هر كاري را كه بخواهند بكنند. اين والدين بيش از حد پاسخ\u200Cدهنده هستند و بر اين باورند كه حمايت و تأمين نيازهاي كودك و نداشتن محدوديت باعث پرورش كودكي خلاق و با اعتماد مي\u200Cشود. والدینی که از روش فرزندپروری آسان\u200Cگیرانه استفاده می\u200Cکنند، مهرورز و پذیرا هستند ولی متوقع نیستند کنترل کمی بر رفتار فرزندان خود اعمال می کنند و به آن\u200Cها اجازه می\u200Cدهند در هر سنی که باشند خودشان تصمیم\u200Cگیری کنند، حتی اگر هنوز قادر به انجام این کار نباشند. ",
                false
            ),
            FinalResult(
                "شما مستبد هستید!",
                arrayListOf(1, 3, 5, 8, 11, 17),
                " والدین مستبد سرد و طردکننده هستند. در اين خانواده\u200Cها كودك هيچ آزادي و اختياري ندارد و هرآن\u200Cچه را خانواده ديكته مي\u200Cكنند، بايستي بدون اين\u200Cكه به منطق آن آگاه باشد، بي\u200C چون و چرا بپذيرد. اگر کودک مقاومت نشان دهد، والدین مستبد به فشار و تنبیه متوسل می\u200Cشوند. کودکان ممکن است برای اجتناب از تنبیه و درگیری، از مقرارت خشک پیروی کرده و به این ترتیب رضایت والدین را جلب می\u200Cکنند و این را هم می\u200Cآموزند که از والدین خود بترسند، اما یاد نمی\u200Cگیرند که برای خودشان فکر کنند. این سبک مستبد، اطمینان کودکان را از بین می\u200Cبرد و آزادی و حق انتخاب را از آن\u200Cها سلب می\u200Cکند.\n",
                false
            ),
            FinalResult(
                "شما قاطع هستید!",
                arrayListOf(4, 6, 10, 13, 15, 18, 20),
                " این سبک صحیح\u200Cترین و موفق\u200Cترین سبک است. این سبک برای کودکان محدودیت در نظر می\u200Cگیرد و در چهارچوب آن محدودیت، به کودکان حق انتخاب می\u200Cدهد. والدین واجد این سبک فرزندانشان را به سویی می\u200Cبرند که خودشان تصمیم\u200Cگیری کنند. آن\u200Cها نظر فرزندانشان را در مورد بعضی از تصمیم\u200Cگیری\u200Cهای خانوادگی می\u200Cپرسند و بدین ترتیب به آن\u200Cها نشان می\u200Cدهند که بر رأی و نظرشان احترام قائل\u200Cاند. والدین مقتدر در عین حال کنترل قاطع و معقولی را اعمال می\u200Cکنند. آن\u200Cها روی رفتار پخته تأکید دارند و برای خواسته\u200Cها و انتظارات خود دلیل می\u200Cآورند. والدین مقتدر به تدریج استقلال مناسب به کودک داده و به او اجازه می\u200Cدهند در زمینه\u200Cهایی که آمادگی دارد تصمیماتی را بگیرد. تربیت مقتدرانه در طول دوره کودکی باعث ایجاد شایستگی، خلق خوش\u200Cبینانه، خویشتن\u200Cداری، استقامت در تکلیف، همکاری، احساس ارزشمندی بالا، پختگی اجتماعی و اخلاقی و عملکرد تحصیلی مطلوب می\u200Cشود."
            )
        )
    ),
    QUIZ2(
        1,
        "مقیاس سبک تربیتی والدین",
        AnswerType.AGREEMENT_LEVEL_5,
        arrayListOf(
            FinalResult(
                "شما سهل گیر هستید!",
                arrayListOf(9, 17, 19, 20),
                " اين والدين در زندگي فرزندان خود خيلي دخالت مي\u200Cكنند بدون آن\u200Cكه محدوديت و كنترل بر آن\u200Cها اعمال شود. آنان چندان توقع از فرزندان خود ندارند و اجازه مي\u200Cدهند كه هر كاري را كه بخواهند بكنند. اين والدين بيش از حد پاسخ\u200Cدهنده هستند و بر اين باورند كه حمايت و تأمين نيازهاي كودك و نداشتن محدوديت باعث پرورش كودكي خلاق و با اعتماد مي\u200Cشود. والدینی که از روش فرزندپروری آسان\u200Cگیرانه استفاده می\u200Cکنند، مهرورز و پذیرا هستند ولی متوقع نیستند کنترل کمی بر رفتار فرزندان خود اعمال می کنند و به آن\u200Cها اجازه می\u200Cدهند در هر سنی که باشند خودشان تصمیم\u200Cگیری کنند، حتی اگر هنوز قادر به انجام این کار نباشند. ",
                false
            ),
            FinalResult(
                "شما مستبد هستید!",
                arrayListOf(2, 3, 8, 11, 13, 16),
                " والدین مستبد سرد و طردکننده هستند. در اين خانواده\u200Cها كودك هيچ آزادي و اختياري ندارد و هرآن\u200Cچه را خانواده ديكته مي\u200Cكنند، بايستي بدون اين\u200Cكه به منطق آن آگاه باشد، بي\u200C چون و چرا بپذيرد. اگر کودک مقاومت نشان دهد، والدین مستبد به فشار و تنبیه متوسل می\u200Cشوند. کودکان ممکن است برای اجتناب از تنبیه و درگیری، از مقرارت خشک پیروی کرده و به این ترتیب رضایت والدین را جلب می\u200Cکنند و این را هم می\u200Cآموزند که از والدین خود بترسند، اما یاد نمی\u200Cگیرند که برای خودشان فکر کنند. این سبک مستبد، اطمینان کودکان را از بین می\u200Cبرد و آزادی و حق انتخاب را از آن\u200Cها سلب می\u200Cکند.\n",
                false
            ),
            FinalResult(
                "شما قاطع هستید!",
                arrayListOf(4, 6, 7, 10, 18, 21),
                " این سبک صحیح\u200Cترین و موفق\u200Cترین سبک است. این سبک برای کودکان محدودیت در نظر می\u200Cگیرد و در چهارچوب آن محدودیت، به کودکان حق انتخاب می\u200Cدهد. والدین واجد این سبک فرزندانشان را به سویی می\u200Cبرند که خودشان تصمیم\u200Cگیری کنند. آن\u200Cها نظر فرزندانشان را در مورد بعضی از تصمیم\u200Cگیری\u200Cهای خانوادگی می\u200Cپرسند و بدین ترتیب به آن\u200Cها نشان می\u200Cدهند که بر رأی و نظرشان احترام قائل\u200Cاند. والدین مقتدر در عین حال کنترل قاطع و معقولی را اعمال می\u200Cکنند. آن\u200Cها روی رفتار پخته تأکید دارند و برای خواسته\u200Cها و انتظارات خود دلیل می\u200Cآورند. والدین مقتدر به تدریج استقلال مناسب به کودک داده و به او اجازه می\u200Cدهند در زمینه\u200Cهایی که آمادگی دارد تصمیماتی را بگیرد. تربیت مقتدرانه در طول دوره کودکی باعث ایجاد شایستگی، خلق خوش\u200Cبینانه، خویشتن\u200Cداری، استقامت در تکلیف، همکاری، احساس ارزشمندی بالا، پختگی اجتماعی و اخلاقی و عملکرد تحصیلی مطلوب می\u200Cشود."
            ),
            FinalResult(
                "شما بی اعتنا هستید!",
                arrayListOf(1, 5, 12, 14, 15),
                " والدين دارای این سبک نسبت به فرزندانشان بي\u200Cتفاوتند. آن\u200Cها خود را با زندگي فرزندانشان درگير نمي\u200Cكنند. به عبارتي آن\u200Cها از پذيرش مسئوليت براي فرزندانشان اجتناب مي\u200Cكنند. اين والدين غيرپاسخ\u200Cگو و بي\u200Cتوقع هستند، به نيازهاي بچه\u200Cها توجه چنداني ندارند و كنترل ضعيفي روي آن\u200Cها دارند. اين والدين غافل و ناديده\u200Cانگارند مانند والديني كه نسبت به تحصيل فرزندانشان بي\u200Cتفاوتند و از اوضاع درسي آن\u200Cها بي\u200Cاطلاع هستند. فرزندان چنين والديني معمولاً لوس، طغيان\u200Cگر و پرخاشگر مي\u200Cشوند. این والدین اغلب از لحاظ عاطفی جدا و افسرده و غمگین هستند و به قدری غرق در استرس خانوادگی هستند که وقت و انرژی کمی برای فرزندان دارند. ",
                false

            )
        )
    ),
    QUIZ3(
        2,
        "پرسشنامه شیوه\u200Cهای فرزندپروری بامریند",
        AnswerType.AGREEMENT_LEVEL_5,
        arrayListOf(
            FinalResult(
                "شما سهل گیر هستید!",
                arrayListOf(1, 6, 10, 13, 14, 17, 19, 24, 28, 29),
                "در این روش فرزند پروری پدر و مادر معتقدند که کودک باید آزاد باشه که هرکاری دوست داره انجام بده. چنین پدر و مادری بدون اعمال کنترل بر فرزندانشون، اون ها رو غرق در محبت خود می کنند. این والدین با تنبیه کودک مخالف هستند و اگه فرزندشون کار اشتباهی کنه، او رو تنبیه نمی کنند.",
                false
            ),
            FinalResult(
                "شما مستبد هستید!",
                arrayListOf(2, 3, 7, 9, 12, 16, 18, 21, 25, 26),
                "والدینی که شیوه تربیتی آن ها مستبدانه است، بسیار متوقع هستند. نگرش این والدین این است که همان کاری را که من گفتم انجام بده! چون آن ها انتظار دارند فرزندانشان از دستورات آن ها بی چون و چرا اطاعت کنند، کمتر به گفت وگو با آن ها می پردازند، اگر کودک اطاعت نکند والدین به فشار و تنبیه متوسل می شوند.",
                false
            ),
            FinalResult(
                "شما قاطع هستید!",
                arrayListOf(4, 5, 8, 11, 15, 20, 22, 23, 27, 30),
                "در شیوه فرزند پروری مقتدرانه، والدین کودک را تشویق می\u200Cکنند مستقل فکر کند، اما هرگز تسلیم او نمی\u200Cشوند و انتظار دارند کودک هم با آن\u200Cها همکاری کند و رفتار مناسبی از خود نشان دهد. وقتی کودک کار اشتباهی می\u200Cکند، والدین مقتدر رفتار کودک را مدیریت می\u200Cکنند و انتظاراتشان را براساس موقعیت و نیازهای فردی او تغییر می\u200Cدهند. براساس پژوهش\u200Cها، از میان شیوه\u200Cهای فرزند پروری، این روش بهترین نتیجه را برای فرزندان داشته است. فرزندی که به روش مقتدرانه تربیت می\u200Cشود سلامت هیجانی بهتر، مهارت\u200Cهای عاطفی و اجتماعی بالاتر، انعطاف\u200Cپذیری بیشتر و در عین حال، دلبستگی ایمنی دارد. \n"
            )
        ), 3000
    ),
    QUIZ4(
        3,
        "پرسشنامه فرزندپروری آلاباما (فرم والدین)",
        AnswerType.FREQUENCY_LEVEL,
        arrayListOf(
            FinalResult(
                "مشارکت مناسب والدین",
                arrayListOf(1, 4, 7, 9, 11, 14, 15, 20, 23, 26),
                "با کودک رفتار دوستانه ای داشتن، در بازی های آنان شرکت کردن، کمک به کودک در زمینه های مختلف و مشارکت کودک در برنامه ریزی خانواده "
            ),
            FinalResult(
                "فرزندپروری مثبت",
                arrayListOf(2, 5, 13, 16, 18, 27),
                "به معنای تشویق و تنبیه به موقع"
            ),
            FinalResult(
                "عدم ثبات در نحوه برخورد با فرزند",
                arrayListOf(3, 8, 12, 22, 25, 31),
                "عدم انجام تحسین و تشویق به موقع",
                false
            ),
            FinalResult(
                "ضعف در نظارت و راهنمایی مناسب",
                arrayListOf(6, 10, 17, 19, 21, 24, 28, 29, 30, 32),
                "والدین از رفت و آمد فرزندشان اطلاع دقیقی ندارند و دوستانش را نمی شناسند.",
                false
            ),
            FinalResult(
                "بکاربردن تنبیه بدنی",
                arrayListOf(33, 35, 39),
                "والدینی که در تربیت کودک خود از تنبیه بدنی استفاده می کنند.",
                false
            )
        ), 3000
    ),
    QUIZ5(
        4,
        "پرسشنامه فرزندپروری آلاباما (فرم كودكان)",
        AnswerType.FREQUENCY_LEVEL,
        arrayListOf(
            FinalResult(
                "مشارکت مناسب مادر",
                arrayListOf(1, 5, 9, 12, 15, 19, 21, 27, 31, 35),
                "به معنای تشویق و تنبیه به موقع"
            ),
            FinalResult(
                "مشارکت مناسب پدر",
                arrayListOf(2, 6, 10, 13, 16, 20, 22, 28, 32, 36),
                "به معنای تشویق و تنبیه به موقع"
            ),
            FinalResult(
                "فرزندپروری مثبت",
                arrayListOf(3, 7, 18, 23, 25, 37)
            ),
            FinalResult(
                "عدم ثبات در نحوه برخورد با فرزند",
                arrayListOf(4, 11, 17, 30, 34, 41),
                "عدم انجام تحسین و تشویق به موقع ",
                false
            ),
            FinalResult(
                "ضعف در نظارت و راهنمایی مناسب",
                arrayListOf(8, 14, 24, 26, 29, 33, 38, 39, 40, 42),
                "والدین از رفت و آمد فرزندشان اطلاع دقیقی ندارند و دوستانش را نمی شناسند.",
                false
            ),
            FinalResult(
                "بکاربردن تنبیه بدنی",
                arrayListOf(43, 45, 49),
                "والدینی که در تربیت کودک خود از تنبیه بدنی استفاده می کنند.",
                false
            )
        ), 3000
    ),
    QUIZ6(
        5,
        "پرسشنامه فرزندپروری یانگ",
        AnswerType.PARENT_CHOICE, price = 5000
    ),
    QUIZ7(
        6,
        "پرسشنامه والدگری آلاباما",
        AnswerType.FREQUENCY_LEVEL,
        arrayListOf(
            FinalResult(
                "والدگری مثبت",
                arrayListOf(1, 6, 7),
                "به معنای تشویق و تنبیه به موقع"
            ),
            FinalResult(
                "عدم ثبات در نحوه برخورد با فرزند",
                arrayListOf(2, 4, 9),
                "عدم انجام تحسین و تشویق به موقع ",
                false
            ),
            FinalResult(
                "ضعف در هدایت و راهنمایی",
                arrayListOf(3, 5, 8),
                "والدین از رفت و آمد فرزندشان اطلاع دقیقی ندارند و دوستانش را نمی شناسند.",
                false
            )
        )
    ),
}

fun getQuiz(quizType: QuizType): Quiz {
    val quiz = Quiz(
        quizType.id,
        quizType.title,
        descriptionList[quizType.id],
        quizType.answerType,
        price = quizType.price
    )
    questionsList[quizType.id].forEachIndexed { index, s ->
        quiz.questions.add(Question(index + 1, s))
    }
    return quiz
}


fun getQuizResult(quizType: QuizType, answerList: ArrayList<Answer>): FinalResult {
    val finalAnswers = quizType.finalResults
    val scores = Array(finalAnswers.size) { 0 }
    finalAnswers.forEachIndexed { index, finalAnswer ->
        answerList.forEachIndexed { answerIndex, answer ->
            if (finalAnswer.targetQuestions.contains(answerIndex + 1)) {
                scores[index] += answer.answer
            }
        }
        scores[index] /= finalAnswer.targetQuestions.size
    }
    return finalAnswers[scores.indices.maxBy { scores[it] } ?: 0]
}
