package com.mhmdreza.azmoonyar.data

import android.text.SpannableStringBuilder
import androidx.core.text.bold
import androidx.core.text.toSpannable
import com.mhmdreza.azmoonyar.data.quizes.*


class DataProvider {
     val quizList = arrayListOf(
         getQuiz(QuizType.QUIZ1),
         getQuiz(QuizType.QUIZ2),
         getQuiz(QuizType.QUIZ3),
         getQuiz(QuizType.QUIZ4),
         getQuiz(QuizType.QUIZ5),
         getQuiz(QuizType.QUIZ6),
         getQuiz(QuizType.QUIZ7),
         getQuiz8(),
         getQuiz9()
    )

    companion object{
        private var instance: DataProvider? = null

        @Synchronized
        fun getInstance(): DataProvider {
            if (instance == null){
                instance = DataProvider()
            }
            return instance!!
        }
    }
}

val description1 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("فرم اولیه این پرسشنامه دارای 20 سؤال است که در کشورهای غربی بی\u200Cشک به نوعی مورد توجه بوده است؛ اما با توجه به متفاوت بودن روش فرزندپروری در کشور ایران و کشورهای غربی پرسشنامه با شرایط ایران تنظیم گردید. این پرسشنامه شیوه\u200Cهای فرزند پروری والدین را در سه سطح اندازه\u200Cگیری می\u200Cکند. \n")
    .bold { append("لطفا جملاتی که در ادامه می\u200Cآید را با دقت مطالعه کرده و مناسب\u200Cترین گزینه را انتخاب نمایید.\n") }
    .append("\n\n").toSpannable()


val description2 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("این مقیاس دارای 21 عبارت است که برای ارزیابی 4 سبک فرزندپروری مستبدانه، بی\u200Cاعتنا، سهل\u200Cگیرانه و قاطعانه والدین طراحی و تهیه شده است.")
    .bold { append("لطفا جملاتی که در ادامه می\u200Cآید را به دقت مطالعه کرده و مناسب\u200Cترین گزینه را انخاب نمایید.\n") }
    .append("\n\n")
    .toSpannable()

val description3 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("اين ابزار اقتباسي است از نظريه اقتدار والدين كه بر اساس نظريه بامريند از آزادگذاري، استبدادي و اقتدار منطقي والدين، براي بررسي الگوهاي نفوذ و شيوه\u200Cهاي فرزندپروري ساخته شده است. اين پرسشنامه شامل 30 ماده است كه 10 ماده آن به شيوه آزادگذاري مطلق، 10 ماده به شيوه استبدادي و 10 ماده ديگر به شيوه اقتدار منطقي والدين در امر پرورش فرزند مربوط مي\u200Cشود. " + "\n")
    .bold { append("والدين گرامي: با سلام\n") }
    .append("\n" + "معمولاً والدين روش\u200Cهاي متفاوتي براي تربيت فرزندان به\u200Cكار مي\u200Cگيرند. در ادامه عباراتي می\u200Cآید كه برخي از روش\u200Cهاي فرزندپروري را توصيف مي\u200Cكند. پاسخ هر عبارت در يك پيوستار 5 درجه\u200Cاي از كاملاً موافقم تا كاملاً مخالفم قرار گرفته است. لطفاً هر يك از عبارات را به\u200Cدقت مطالعه كرده و مناسب\u200Cترين پاسخ كه با نگرش تربيتي شما هماهنگ است را انتخاب كنيد.")
    .append("\n\n")
    .toSpannable()

val description4 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("اين پرسشنامه يك ابزار خودگزارشي و داراي 42 عبارت است كه پنج بعد رفتار فرزندپروری: مشاركت والدين، فرزندپروری مثبت، ضعف در نظارت و راهنمايي، عدم ثبات در نحوه برخورد با فرزند و تنبيه بدني را مورد ارزيابي قرار مي\u200Cدهد. \n")
    .bold { append("شيوه نمره\u200Cگذاري \n") }
    .append("آزمودني (يكي از والدين) در فرم والدين بايد در يك مقياس ليكرت 5 درجه\u200Cاي (از هرگز =1 تا هميشه =5) مشخص سازد كه هر يك از عبارات تا چه حد در مورد تعامل وي با فرزندش صدق مي\u200Cكند. اين مقياس براي والديني كه فرزندشان بين 8 تا 16 سال سن دارد، مناسب است. \n" + "در ادامه، تعدادی جمله در مورد خانواده\u200Cتان آمده است. لطفاً بر حسب اینکه هر مورد معمولاً چقدر در خانه\u200Cتان اتفاق می\u200Cافتد به آن\u200Cها امتیاز دهید. پاسخ\u200Cهایی که می\u200Cتوانید از آن\u200Cها استفاده کنید عبارتند از:\n" + "هرگز (1)، تقریباً هیچ وقت (2)، گاهی اوقات (3)، اغلب اوقات (4)، همیشه (5). لطفاً به همه موارد پاسخ بدهید.\n")
    .append("\n\n")
    .toSpannable()

val description5 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("اين پرسشنامه يك ابزار خودگزارشي و داراي 42 عبارت است كه پنج بعد رفتار فرزندپروری که عبارتند از مشاركت والدين (پدر و مادر به طور جداگانه)، فرزندپروری مثبت، ضعف در نظارت و راهنمايي، عدم ثبات در نحوه برخورد با فرزند و تنبيه بدني را مورد ارزيابي قرار مي\u200Fدهد. لازم به ذكر است كه عبارات مربوط به زيرمقياس مشاركت والدين هر كدام از دو بخش تشكيل شده، كه يك بخش مربوط به مشاركت مادر و ديگري مربوط به مشاركت پدر است. \n" + "در ادامه، تعدادی جمله در مورد خانواده\u200Cتان آمده است. لطفاً بر حسب اینکه هر مورد معمولاً چقدر در خانه\u200Cتان اتفاق می\u200Cافتد به آن\u200Cها امتیاز دهید. پاسخ\u200Cهایی که می\u200Cتوانید از آن\u200Cها استفاده کنید عبارتند از:\n" + "هرگز (1)، تقریباً هیچ وقت (2)، گاهی اوقات (3)، اغلب اوقات (4)، همیشه (5). لطفاً به همه موارد پاسخ بدهید.\n")
    .append("\n\n")
    .toSpannable()

val description6 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("اين ابزار اقتباسي است از نظريه اقتدار والدين كه بر اساس نظريه بامريند از آزادگذاري، استبدادي و اقتدار منطقي والدين، براي بررسي الگوهاي نفوذ و شيوه\u200Cهاي فرزندپروري ساخته شده است. اين پرسشنامه شامل 30 ماده است كه 10 ماده آن به شيوه آزادگذاري مطلق، 10 ماده به شيوه استبدادي و 10 ماده ديگر به شيوه اقتدار منطقي والدين در امر پرورش فرزند مربوط مي\u200Cشود. " + "\n")
    .bold { append("والدين گرامي: با سلام\n") }
    .append("\n" + "معمولاً والدين روش\u200Cهاي متفاوتي براي تربيت فرزندان به\u200Cكار مي\u200Cگيرند. در ادامه عباراتي می\u200Cآید كه برخي از روش\u200Cهاي فرزندپروري را توصيف مي\u200Cكند. پاسخ هر عبارت در يك پيوستار 5 درجه\u200Cاي از كاملاً موافقم تا كاملاً مخالفم قرار گرفته است. لطفاً هر يك از عبارات را به\u200Cدقت مطالعه كرده و مناسب\u200Cترين پاسخ كه با نگرش تربيتي شما هماهنگ است را انتخاب كنيد.")
    .append("\n\n")
    .toSpannable()

val description7 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("\n" + "اين پرسشنامه يك ابزار خودگزارشي و داراي 9 عبارت بوده و سه زيرمقياس: والدگری مثبت، عدم ثبات در نحوه برخورد با فرزند و ضعف در نظارت و راهنمايي را مورد ارزيابي قرار مي\u200Cدهد. \n" + "در ادامه، تعدادی جمله در مورد خانواده\u200Cتان آمده است. لطفاً بر حسب اینکه هر مورد معمولاً چقدر در خانه\u200Cتان اتفاق می\u200Cافتد به آن\u200Cها امتیاز دهید. پاسخ\u200Cهایی که می\u200Cتوانید از آن\u200Cها استفاده کنید عبارتند از:\n" + "هرگز (1)، تقریباً هیچ وقت (2)، گاهی اوقات (3)، اغلب اوقات (4)، همیشه (5). لطفاً به همه موارد پاسخ بدهید.\n")
    .append("\n\n")
    .toSpannable()

val description8 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("مقياس شيوۀ فرزندپروري به منظور تصحيح برخي از محدويت\u200Cها و نقايص ابزار پيوند والديني ساخته شد. اين آزمون يك مقياس 15 عبارتی دربارۀ شیوه فرزندپروري نامطلوب است.\n" + "در این آزمون در واقع این نوجوانان هستند که سبک فرزندپروری والدین خود را مورد ارزیابی قرار می دهند.\n" + "\n" + "\n" + " آزمودني\u200Cها بايد با استفاده از يك مقياس ليكرت 4 درجه\u200Cاي (به هيچ وجه درست نيست=0، كمي درست= 1، تقريباً درست =2 و كاملاً درست=3) مشخص سازند كه عبارت مورد نظر تا چه حد معرف رفتار پدر يا مادر آنها در خلال 16 سال اول زندگي بوده است. مقياس شيوۀ فرزندپروري داراي دو فرم جداگانه (يكي مربوط به مادر و ديگري مربوط به پدر) است كه برحسب ماهيت پژوهش و هدف از اجراي آزمون مي\u200Cتوان از دو فرم يا تنها يكي از فرم\u200Cها استفاده كرد. اين آزمون داراي 3 زيرمقياس: بي\u200Cتفاوت  (6 عبارت)، كنترل مفرط (4 عبارت) و سوءاستفاده (بدرفتاري)  (5 عبارت) است.\n")
    .append("\n\n")
    .toSpannable()

val description9 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("\n" + "این پرسشنامه 30 ماده\u200Cاي توسط آرنولد و همكاران (1993) طراحي شده و با پاسخ به آن، بهترين توصيف از شيوه فرزندپروري در طي دو ماه گذشته به\u200Cصورت خودسنجي و توسط خود والدين به\u200Cدست مي\u200Cآيد. اين پرسشنامه سه الگوي انضباطي ناكارآمد والدين را مي\u200Cسنجد. \n")
    .bold { append("والدين گرامي: با سلام\n") }
    .append(
        "معمولاً شما روش\u200Cهاي متفاوتي براي برخورد با مشكلات پيش مي\u200Cگيريد. در متن زير عباراتي است كه برخي  از روش\u200Cهاي فرزندپروري را توصيف مي\u200Cكند. براي هر عبارت يك مقياس 7 درجه\u200Cاي آمده كه در دو طرف آن دو نمونه رفتار توصيف شده است كه معمولاً در نقطه مقابل يكديگر هستند. مثلاً در مورد مثال زير يعني \"هنگام صرف غذا \" در سمت راست نوشته شده است كه \" مي\u200C\u200Cگذارم كودكم تصميم بگيرد چقدر بخورد.\" و در سمت چپ دقيقاً رفتار متضاد آن آمده است. يعني \"من تصميم مي\u200Cگيرم كودكم چقدر بخورد.\" اگر روش شما هميشه و دقيقاً مطابق جمله سمت راست است در جدول علامت بزنيد، اگر اكثر اوقات روش جمله سمت راست را استفاده مي\u200Cكنيد ولي نه هميشه، در عدد 2 را علامت بزنيد. اما اگر روش شما هميشه و دقيقاً مطابق جمله سمت چپ است، عدد 7 را علامت بزنيد و در صورتي كه اكثر اوقات چنين است، عدد 6 را علامت بزنيد. اگر گاهي از اين روش و گاهي از آن روش استفاده مي\u200Cكنيد، بر اساس اين\u200Cكه بيشتر به كدام روش متمايل است در اعداد 3، 4، يا 5 را انتخاب كنيد. لطفاً\u200C جملات زير را بخوانيد و در مورد هر جمله، عددي كه بهتر از همه روش فرزندپروري شما را در طي دو ماه گذشته توصيف مي\u200Cكند، را علامت بزنيد."
    )
    .append("\n\n")
    .toSpannable()


val questions1 = arrayListOf(
    "والدین باید زمانی را در کنار کودکان باشند تا لذت در کنار هم بودن را تجربه کنند.",
    "والدین باید محبت خود به کودکان را به طور کلامی ابراز کنند.",
    "والدین باید دلیل کارهای خود در خانه را توضیح دهند و ریشه مشکلات را شناسایی کنند.",
    "والدین باید روش صحیح آداب و احترام به بزرگتر  را به فرزندان یاد دهند.",
    "توقع والدین از کودکان باید در حد توان و درک آن\u200Cها باشد.",

    "بچه\u200Cها نباید هیچ مخالفتی نسبت خواسته پدر و مادر داشته باشند.",
    "والدین باید اجازه دهند کودکان کنجکاوی کنند و هر چه را که در جهت افزایش کارایی مثبت کودک مورد نیاز است فراهم نمایند.",
    "والدین باید با تقویت نیروی ایمان و الگو بودن، گودکان را آموزش و مشاوره دهند و هدایت نمایند.",
    "با کودکان باید با زبان خود آن\u200Cها سخن گفت و دلایل منطقی بعضی از مخالفت\u200Cها را بیان کرد.",
    "والدین باید در تصمیم\u200Cگیری\u200Cها آن\u200Cچه صلاح خانواده است انجام دهند.",

    "اگر والدین وقت و فرصت کافی برای گوش کردن به صحبت کودکان داشته باشند مشکلات کمتر می\u200Cشود.",
    "والدین باید به نظرات فرزندان گوش دهند و در صورت مفید بودن از آن هم استفاده کنند.",
    "والدین می\u200Cتوانند با نظرات غیر اصولی و غیر اخلاقی کودکان مخالفت کنند.",
    "والدین باید با بچه\u200Cها اجازه دهند تا در تصمیم\u200Cگیری\u200Cها نقش داشته باشند تا معنای مشورت را بدانند. 1",
    "شوخی و بازی غیر اخلاقی بچه\u200Cها در حضور والدین صحیح نیست.",

    "والدین در مواقعی باید کودکان را نوازش کرده و در آغوش بگیرند.",
    "بچه\u200Cها باید جرأت بیان عقاید و اظهار نظر در حضور والدین داشته باشند.",
    "کودکان اذیت کار باید به\u200Cطور غیر مستقیم بیاموزند و از بزرگ\u200Cترها حساب ببرند و دلایل منطقی را بدانند.",
    "کودکان باید اجازه داشته باشند مشکلات خود را با والدین مطرح کنند و والدین باید صبور باشند.",
    "اگر بچه\u200Cها را زیر نظر نداشته باشیم و تذکرات توأم با نصیحت به موقع ندهیم تلاش نمی\u200Cکنند و پیشرفت نخواهند کرد."
)

val questions2 = arrayListOf(
    "والدین باید به بچه\u200Cهای خود اجازه دهند تا هر موقع مایلند به تکالیف درسی خود بپردازند",
    "بچه\u200Cها باید همیشه در هرکاری مخصوصاً تحصیلات رضایت والدین را جلب کنند در غیر این \u200Cصورت باید تنبیه شوند.",
    "در تعیین رشته\u200C تحصیلی باید والدین تصمیم\u200Cگیرنده باشند زیرا فرزندان صلاح خود را نمی\u200Cدانند.",
    "در صورتی\u200Cکه فرزندان به کاری غیر از آن\u200Cچه والدین صحیح می\u200Cدانند بپردازند، باید با دلیل آن\u200Cها را راهنمایی کرد.",
    "5بچه\u200Cها خود به خود به سمت آن\u200Cچه که برای آن\u200Cها مناسب است هدایت می\u200Cشوند و باید از امر و نهی زیاد آن\u200Cها پرهیز کرد.",
    "در انتخاب رشته تحصیلی و انتخاب حرفه برای آینده فرزندان، والدین باید هدایت\u200Cکننده باشند و نظر خود را تحمیل نکنند.",
    "فرزندان در عقاید مذهبی باید پیرو والدین\u200Cشان باشند، اما اگر خلاف میل آن\u200Cها بود باید بتوانند آزادانه آن را با والدین مطرح کنند.",
    "مذهب و اعتقادات چیزی نیست که بچه\u200Cها بتوانند در مورد آن با والدین مخالفت کنند.",
    "عقاید و مذهب چیزی نیست که به فرزندان دیکته شود، باید آن\u200Cها را در انتخاب آزاد گذاشت.",
    "اگر فرزندان در برخی موارد برخلاف والدین عمل کردند، والدین به\u200Cجای تنبیه باید آن\u200Cها را راهنمایی کنند.",
    "از همان دوره کودکی فرزندان باید متوجه شوند که حاکم خانواده کیست.",
    "تمام مشکلات بچه\u200Cها این است که پدر و مادرها بیش از اندازه آن\u200Cها را محدود می\u200Cکنند.",
    "در صورت مخالفت فرزندان با نظرات والدین باید به\u200Cشدت با آن\u200Cها برخورد کرد.",
    "باید به فرزندان در هر سنی اجازه داد برای خود تصمیم بگیرند.",
    "فرزندان برای بازی و تفریح باید بتوانند در هر موقعیتی از خانه خارج شوند.",
    "تفریح و بازی در حضور پدر و مادر یک بی\u200Cاحترامی به حساب می\u200Cآید.",
    "اگر در مواردی فرزندان کار اشتباهی انجام دهند هرگز نباید آن\u200Cها را سرزنش کرد.",
    "اگر والدین برای فرزندان تصمیمی بگیرند که بر خلاف میل آن\u200Cها باشد باید با آن\u200Cها گفتگو کنند یا حتی اگر در تصمیم خود اشتباه کرده بودند، آن را بپذیرند.",
    "فرزندان باید آزاد گذاشته شوند تا با تجربه کردن خودشان آینده\u200Cی خود را رقم بزنند.",
    "هر چند فرزندان گاهی اشتباه می\u200Cکنند، ولی در بعضی اوقات نظرات آن\u200Cها قابل قبول است.",
    "اگر فرزندان به محدویت\u200Cهایی که والدین برای آن\u200Cها قائلند اعتراض داشتند والدین باید با صحبت کردن آن\u200Cها را قانع کنند."
)

val questions3 = arrayListOf(
    "والدين بايد به بچه\u200Cهاي خود اجازه دهند تا هر آنچه را كه مي\u200Cخواهند انجام دهند.",
    "بچه\u200Cها بايد فقط از آنچه كه والدينشان مي\u200Cگويند پيروي كنند و در غير اين صورت بايد آنها را تنبيه كرد.",
    "اگر به مشكلات بچه\u200Cها توجه شود اين دردسر را به دنبال دارد كه آنها پرروتر شده و انتظارات بيشتري از والدين خواهند داشت.",
    "هرگاه والدين تصميمي براي بچه\u200Cها بگيرند بايد دلايل آن را به آنها بگويند.",
    "اگر بچه\u200Cها نسبت به محدوديت ايجاد شده در خانواده اعتراض كردند، والدين بايد با صحبت كردن آنها را قانع كنند.",
    "والدين نبايد در كارهاي مربوط به بچه\u200Cها دخالت كنند چون بچه\u200Cها به\u200Cطور ذاتي راه خودشان را پيدا مي\u200Cكنند.",
    "اگر بچه\u200Cها كاملاً مطابق ميل والدين خود رفتار كنند در آينده افراد موفقي خواهند شد. ",
    "بچه\u200Cها بايد كاري را كه والدين از آنها انتظار دارند انجام دهند، اما اگر انتظارات والدين غير قابل اجرا بود بايد بتوانند آن\u200C را آزادانه با والدين خود مطرح كنند. ",
    "وقتي والدين از بچه\u200Cها مي\u200Cخواهند تا كاري را انجام دهند، بچه\u200Cها بايد بدون چون و چرا آن\u200Cرا انجام دهند.",
    "والدين نبايد بچه\u200Cها را در منزل محدود كنند بلكه بايد آنها را آزاد بگذارند تا تمام لوازم اطراف خود را دستكاري كنند.",
    "هرگاه بچه\u200Cها برخلاف ميل والدين رفتار كردند والدين بايد به\u200Cجاي تنبيه آنها را راهنمايي كنند.",
    "والدين خيلي زود بايد به بچه\u200Cها بفهمانند كه رئيس خانواده چه كسي است.",
    "عبارات",
    "والدين بايد در تصميم\u200Cگيري\u200Cهاي مربوط به خانواده فقط آنچه را كه خواست بچه\u200Cها است، انجام دهند.",
    "اگر والدين رفتار و خواسته\u200Cهاي بچه\u200Cها را محدود نكنند، بيشتر مشكلات حل مي\u200Cشود.",
    "والدين بايد هنگام تصميم\u200Cگيري در مورد مسائل و برنامه\u200Cهاي خانواده نظر بچه\u200Cها را دخالت دهند و از آنها نيز نظرخواهي كنند.",
    "والدين بايد با بچه\u200Cهايي كه با نظر آنها مخالفت مي\u200Cكنند به شدت برخورد نمايند.",
    "والدين بايد به بچه\u200Cها اجازه دهند تا در كارها خودشان تصميم\u200Cگيرنده باشند.",
    "شوخي و بازي كردن بچه\u200Cها در حضور والدين توهين به آنها است.",
    "بچه\u200Cها به بازي و تفريح نياز دارند، براي اين كار والدين بايد به آنها اجازه دهند هر وقت دلشان خواست از منزل خارج شوند.",
    "بايد به بچه\u200Cها اجازه داده شود كه اگر فكر مي\u200Cكنند نظرشان از نظرات والدين خود بهتر است آن را ابراز كنند.",
    "وقتي بچه\u200Cها مرتكب اشتباهي مي\u200Cشوند هيچ\u200Cگاه نبايد آنها را سرزنش كرد.",
    "اگر والدين تصميمي برخلاف ميل بچه\u200Cها گرفتند در چنين مواردي بايد با بچه\u200Cها گفتگو كنند و حتي اگر اشتباه كرده بودند آن را بپذيرند.",
    "گاهي اوقات والدين بايد با بچه\u200Cها سازش كنند، نه اين\u200Cكه هميشه انتظار داشته باشند كه بچه\u200Cها با آنها سازش كنند.",
    "بايد اجازه داد تا بچه\u200Cها خودشان تجربه كنند.",
    "بعضي از بچه\u200Cها ذاتاً بد هستند و بايد طوري تربيت شوند كه از والدين خود بترسند.",
    "بچه\u200Cها وقتي بزرگ شوند از سخت\u200Cگيري\u200Cهاي والدين خود سپاسگذاري خواهند كرد.",
    "وقتي بچه\u200Cها دچار مشكل و دردسري شوند (كارخطايي انجام \u200Cدهند) بايد بدانند كه با مطرح كردن آن مشكل براي والدين خود تنبيه نمي\u200Cشوند.",
    "در مجالس و مهماني\u200Cها بايد بچه\u200Cها را آزاد گذاشت تا محيط اطراف خود را دستكاري كنند تا حس كنجكاوي آنها ارضا شود.",
    "بچه\u200Cها جدي و كوشا نخواهند بود مگر اين\u200Cكه درباره كارهاي آنها سخت\u200Cگيري كنيم.",
    "اگر چه بچه\u200Cها تجربه كمي دارند اما گاهي اوقات نظر آنها بهتر از نظر والدين است."
)


val questions4 = arrayListOf(
    "با فرزندتان صحبت\u200Cهاي دوستانه\u200Cاي داريد.",
    "زماني كه فرزندتان كار خوبي انجام مي\u200Cدهد، شما او را متوجه آن كار خوب مي\u200Cكنيد.",
    "فرزندتان را تهديد به تنبيه مي\u200Cكنيد، اما بعداً تنبيهش نمي\u200Cكنيد.",
    "داوطلب كمك به فعاليت\u200Cهاي خاصي كه فرزندتان درگير آن است، مي\u200Cشويد (مثلاً بازي، ورزش، فعاليت\u200Cهاي گروه\u200Cهاي مذهبي و ...).",
    "رفتار خوب فرزندتان را با جايزه يا پاداش مورد تشويق قرار مي\u200Cدهيد.",
    "اگر فرزندتان بخواهد جايي برود براي شما يادداشت نمي\u200Cگذارد تا بدانيد كه كجا رفته است.",
    "با فرزندتان به بازي و تفريح مي\u200Cپردازيد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد بدون آنكه تنبيه شود، با او صحبت مي\u200Cكنيد.",
    "در مورد فعاليت\u200Cهاي روزانه فرزندتان در مدرسه پرس و جو مي\u200Cكنيد.",
    "فرزندتان غروب، پس از زماني كه انتظار مي\u200Cرود در خانه باشد، بيرون مي\u200Cماند.",
    "در انجام تكاليف مدرسه به فرزندتان كمك مي\u200Cكنيد.",
    "تلاش شما براي وادار كردن فرزندتان به انجام كارها بيهوده است چون اين كار برايتان دشوار است.",
    "وقتي فرزندتان كار خوبي انجام مي\u200Cدهد، شما او را تحسين مي\u200Cكنيد.",
    "از فرزندتان در مورد برنامه\u200Cاي كه براي فرداي آن روز دارد، پرس و جو مي\u200Cكنيد.",
    "فرزندتان را به انجام كارهاي خاصي وادار مي\u200Cكنيد.",
    "به خاطر رفتار خوبي كه فرزندتان داشته است، به او جايزه مي\u200Cدهيد.",
    "دوستان فرزندتان (آن\u200Cهايي كه با او هستند) را نمي\u200Cشناسيد.",
    "وقتي فرزندتان كار خوبي انجام مي\u200Cدهد، وي را به آغوش مي\u200Cكشيد يا مي\u200Cبوسيد.",
    "فرزندتان بدون آنكه ساعت بازگشت خود را مشخص كند از خانه خارج مي\u200Cشود.",
    "فرزندتان درباره دوستانش با شما صحبت مي\u200Cكند.",
    "فرزندتان پس از تاریک شدن هوا، بدون همراهی شما بیرون می\u200Cرود.",
    "زودتر از موعد مقرر تنبيه فرزندتان را قطع مي\u200Cكنيد (مثلاً برداشتن محدوديت زودتر از آنچه، اول گفته\u200Cايد).",
    "فرزندتان در برنامه\u200Cريزي فعاليت\u200Cهاي خانوادگي كمك مي\u200Cكند.",
    "شما آنقدر مشغول مي\u200Cشويد كه فراموش مي\u200Cكنيد فرزندتان كجاست و چه مي\u200Cكند.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، تنبيهش نمي\u200Cكنيد.",
    "در جلسات اوليا و مربيان، يا ديگر جلسات مدرسه فرزندتان شركت مي\u200Cكنيد.",
    "وقتي فرزندتان در امور خانه كمك مي\u200Cكند، شما به او مي\u200Cگوييد كه از كارش خشنود شده\u200Cايد.",
    "وقتي فرزندتان دير به خانه مي\u200Cآيد، شما متوجه دير آمدن او نمي\u200Cشويد.",
    "بدون اينكه به فرزندتان بگوييد به كجا می\u200Cرويد، خانه را ترك مي\u200Cكنيد.",
    "فرزندتان با بيش از يك ساعت تأخير از زمان تعيين شده\u200Cاي كه شما منتظرش هستید، از مدرسه به خانه مي\u200Cآيد.",
    "شكل و نوع تنبيهي كه براي فرزندتان به كار مي\u200Cبريد، به وضعيت روحي\u200Cتان بستگي دارد.",
    "فرزندتان بدون اينكه بزرگتري با او باشد، در خانه تنهاست.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، با دست محكم به پشت او مي\u200Cزنيد.",
    "وقتي فرزندتان رفتار اشتباهي انجام مي\u200Cدهد، مورد بي\u200Cاعتنايي شما قرار مي\u200Cگيرد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، به او سيلي مي\u200Cزنيد.",
    "امتيازات يا پولي را كه به فرزندتان داده\u200Cايد، به عنوان تنبيه از او پس مي\u200Cگيريد.",
    "براي تنبيه، فرزندتان را به اتاقش مي\u200Cفرستيد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، شما او را با كمربند، دسته كليد يا اشيای ديگر مي\u200Cزنيد.",
    "وقتي فرزندتان كار اشتباهي انجام مي\u200Cدهد، شما سرش داد و فرياد مي\u200Cكنيد.",
    "هنگامي كه فرزندتان بدرفتاري مي\u200Cكند، شما با خونسردي توضيخ مي\u200Cدهيد كه چرا رفتارش اشتباه بوده است.",
    "براي تنبيه فرزندتان از روش محروم كردن استفاده مي\u200Cكنيد (مثلاً براي مدتي او را از انجام فعاليت\u200Cهاي مورد علاقه\u200Cاش منع مي\u200Cكنيد).",
    "به عنوان تنبيه فرزندتان را وادار به انجام كارهاي سخت مي\u200Cكنيد."
)


val questions5 = arrayListOf(
    "با مادرتان صحبت\u200Fهاي دوستانه\u200Fاي داريد.",
    "با پدرتان صحبت\u200Fهاي دوستانه\u200Fاي داريد.",
    "زماني كه كار خوبي انجام مي\u200Fدهيد، والدينتان شما را متوجه آن كار خوب مي\u200Fكنند.",
    "والدينتان شما را تهديد به تنبيه مي\u200Fكنند، اما بعداً تنبيه\u200Cتان نمي\u200Fكنند.",
    "مادرتان داوطلب كمك به فعاليت\u200Fهاي خاصي كه شما درگير آن هستيد مي\u200Fشود (مثلاً بازي، ورزش، فعاليت\u200Fهاي گروه\u200Fهاي مذهبي و ...).",
    "پدرتان داوطلب كمك به فعاليت\u200Fهاي خاصي كه شما درگير آن هستيد مي\u200Fشود (مثلاً بازي، ورزش، فعاليت\u200Fهاي گروه\u200Fهاي مذهبي و ...).",
    "والدينتان رفتار خوب شما را با جايزه يا پاداش مورد تشويق قرار مي\u200Fدهند.",
    "اگر شما بخواهيد جايي برويد براي والدينتان يادداشت نمي\u200Fگذاريد تا بدانند كه كجا رفته\u200Fايد.",
    "با مادرتان به بازي و تفريح مي\u200Fپردازيد.",
    "با پدرتان به بازي و تفريح مي\u200Fپردازيد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد بدون آنكه تنبيه شويد، با والدينتان صحبت مي\u200Fكنيد.",
    "مادرتان در مورد فعاليت\u200Fهاي روزانه شما در مدرسه پرس و جو مي\u200Fكند.",
    "پدرتان در مورد فعاليت\u200Fهاي روزانه شما در مدرسه پرس و جو مي\u200Fكند.",
    "غروب، پس از زماني كه انتظار مي\u200Fرود در خانه باشيد، بيرون مي\u200Fمانيد.",
    "مادرتان در انجام تكاليف مدرسه به شما كمك مي\u200Fكند.",
    "پدرتان در انجام تكاليف مدرسه به شما كمك مي\u200Fكند.",
    "تلاش والدينتان براي وادار كردن شما به انجام كارها بيهوده است چون آن\u200Cها مي\u200Fدانند اين كار برايشان دشوار است.",
    "وقتي كار خوبي انجام مي\u200Fدهيد، والدينتان شما را تحسين مي\u200Fكنند.",
    "مادرتان از شما در مورد برنامه\u200Fاي كه براي فرداي آن روز داريد، پرس و جو مي\u200Fكند.",
    "پدرتان از شما در مورد برنامه\u200Fاي كه براي فرداي آن روز داريد، پرس و جو مي\u200Fكند.",
    "مادرتان شما را به انجام كارهاي خاصي وادار مي\u200Fكند.",
    "پدرتان شما را به انجام كارهاي خاصي وادار مي\u200Fكند.",
    "به خاطر رفتار خوبي كه داشته\u200Fايد، والدينتان به شما جايزه مي\u200Fدهند.",
    "والدينتان دوستان (آنهايي كه با شما هستند) شما را نمي\u200Fشناسند.",
    "وقتي كار خوبي انجام مي\u200Fدهيد، والدينتان شما را به آغوش مي\u200Fكشند يا مي\u200Fبوسند.",
    "بدون آنكه ساعت بازگشت خود را مشخص كنيد از خانه خارج مي\u200Fشويد.",
    "مادرتان درباره دوستانتان با شما صحبت مي\u200Fكند.",
    "پدرتان درباره دوستانتان با شما صحبت مي\u200Fكند.",
    "پس از تاریک شدن هوا، بدون همراهی پدر یا مادرتان بیرون می\u200Cروید.",
    "والدينتان زودتر از موعد مقرر تنبيه شما را قطع مي\u200Fكنند (مثلاً برداشتن محدوديت، زودتر از آنچه اول گفته\u200Fاند).",
    "شما در برنامه\u200Fريزي فعاليت\u200Fهاي خانوادگي كمك مي\u200Fكنيد.",
    "والدينتان آنقدر مشغول مي\u200Fشوند كه فراموش مي\u200Fكنند شما كجاييد و چه مي\u200Fكنيد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد، والدينتان تنبيه\u200Cتان نمي\u200Fكنند.",
    "مادرتان در جلسات اوليا و مربيان، يا ديگر جلسات مدرسه شركت مي\u200Fكند.",
    "پدرتان در جلسات اوليا و مربيان، يا ديگر جلسات مدرسه شركت مي\u200Fكند.",
    "وقتي در امور خانه كمك مي\u200Fكنيد، والدينتان به شما مي\u200Fگويند كه از كار شما خشنود شده\u200Fاند.",
    "وقتي شما دير به خانه مي\u200Fآيد، والدينتان متوجه دير آمدن شما نمي\u200Fشوند.",
    "والدينتان بدون اينكه به شما بگويند به كجا مي\u200Fروند، خانه را ترك مي\u200Fكنند.",
    "شما با بيش از يك ساعت تأخير از زمان تعيين شده\u200Fاي كه والدينتان منتظرتان هستند، از مدرسه به خانه مي\u200Fآييد.",
    "شكل و نوع تنبيهي كه والدينتان براي شما به كار مي\u200Fبرند، به وضعيت روحيشان بستگي دارد.",
    "شما بدون اينكه بزرگتري با شما باشد، در خانه تنهاييد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد، والدينتان با دست محكم به پشت شما مي\u200Fزنند.",
    "وقتي رفتار اشتباهي انجام مي\u200Fدهيد، مورد بي\u200Fاعتنايي والدينتان قرار مي\u200Fگيريد.",
    "وقتي كار اشتباهي انجام مي\u200Fدهيد، والدينتان به شما سيلي مي\u200Fزنند.",
    "والدينتان امتيازات يا پولي را كه به شما داده\u200Fاند، به عنوان تنبيه از شما پس مي\u200Fگيرند.",
    "والدينتان براي تنبيه، شما را به اتاقتان مي\u200Fفرستند.",
    "وقتي شما كار اشتباهي انجام مي\u200Fدهيد، والدينتان شما را با كمربند، دسته كليد يا اشيای ديگر مي\u200Fزنند.",
    "وقتي شما كار اشتباهي انجام مي\u200Fدهيد، والدينتان سرتان داد و فرياد مي\u200Fكنند.",
    "هنگامي كه شما بدرفتاري مي\u200Fكنيد، والدينتان با خونسردي توضيح مي\u200Fدهند كه چرا رفتارتان اشتباه بوده است.",
    "والدينتان براي تنبيه شما از روش محروم كردن استفاده مي\u200Fكنند (مثلاً براي مدتي شما را از انجام فعاليت\u200Fهاي مورد علاقه\u200Fتان منع مي\u200Fكنند).",
    "والدينتان به عنوان تنبيه شما را وادار به انجام كارهاي سخت مي\u200Fكنند."
)

val questions6 = arrayListOf(
    "عاشقانه مرا دوست داشت و با من مانند يك فرد خاص رفتار مي\u200Cكرد.",
    "زمان هايي را به من اختصاص مي\u200Cداد و به من توجه مي\u200Cكرد.",
    "راهنمايي مفيد و مشورت كمك كننده به من مي\u200Cداد.",
    "حرف\u200Cهاي مرا گوش مي\u200Cكرد، مرا مي\u200Cفهميد، مرا در احساسات خود سهيم مي\u200Cكرد.",
    "گرم بود و محبت خود را به صورت نوازش و در آغوش گرفتن من نشان مي\u200Cداد.",
    "وقتي من بچه بودم فوت كرد يا منزل را براي هميشه ترك كرد.",
    "فردي غير قابل پيش بيني، داراي خلق ناپايدار بود.",
    "برادران يا خواهرانم را به من ترجيح مي\u200Cداد.",
    "براي مدت زمان هاي طولاني مرا تنها مي\u200Cگذاشت.",
    "به من دروغ مي\u200Cگفت، مرا فريب مي داد، با من دشمني مي\u200Cكرد.",
    "مرا مورد آزار جسمي، جنسي يا هيجاني قرار مي\u200Cداد.",
    "از من براي ارضاي نيازهايش استفاده مي\u200C\u200Cكرد.",
    "بنظر مي\u200Cرسيد كه از آزار دادن ديگران لذت مي\u200Cبرد.",
    "شديداً نگران بود كه مبادا به من آسيبي برسد. ",
    "شديداً نگران بود از اين كه من بيمار شوم.",
    "يك فرد ترسو بود. ",
    "بسيار از من حمايت مي\u200Cكرد.",
    "طوري با من رفتار كرده بود كه من احساس كنم نمي\u200Cتوانم به تصميمات يا قضاوت\u200Cهاي خودم اعتماد داشته باشم.",
    "به جاي اين كه اجازه بدهد من خودم به سبكي كه مي خواهم كارهايي را انجام دهم، براي من كارهاي زيادي مي\u200Cكرد.",
    "طوري با من رفتار مي\u200Cكرد كه انگار من خيلي جوانتر (كم سنتر) از سن واقعيم بودم.",
    "خيلي مرا سرزنش مي\u200Cكرد.",
    "طوري با من رفتار كرده بود كه من احساس مي\u200Cكردم دوست نداشتني يا طرد شده هستم.",
    "طوري با من رفتار مي\u200Cكرد كه انگار من ايرادي داشتم.",
    "طوري با من رفتار كرده بود كه من از اين كه مورد احترام قرار بگيرم خجالت مي\u200Cكشيدم.",
    "هرگز آموزش هاي لازم براي موفقيت در مدرسه را به من نياموخت.",
    "طوري با من رفتار مي\u200Cكرد كه انگار من احمق يا دست و پا چلفتي هستم.",
    "واقعاً نمي\u200Cخواست كه من موفق شوم.",
    "انتظار داشت كه من در زندگي يك شكست خورده باشم.",
    "طوري با من رفتار مي \u200Cرد كه انگار نقطه نظرات يا خواسته هاي من اهميتي ندارد.",
    "بدون در نظر گرفتن خواسته هاي من، هر كاري كه مي\u200Cخواست انجام مي\u200Cداد.",
    "طوري زندگي من را كنترل می\u200Cكرد كه من حداقل آزادي را براي انتخاب داشتم.",
    "هر چيزي مطابق نظرات و خواسته هاي والدينم بود.",
    "نيازهاي خودش را قرباني منافع خانواده مي\u200Cكرد.",
    "قادر نبود مسئوليت هاي روزانه خودش را انجام دهد در نتيجه من مجبور بودم بيش از مسئوليت خودم كار كنم.",
    "ناخرسند بود و براي حمايت و درك شدن به من متكي بود.",
    "احساس قوي بودن را در من ايجاد كرده بود به طوري كه من تصور می\u200Cکردم بايد از ديگران مراقبت كنم.",
    "انتظارات بسيار زيادي از خودش داشت. ",
    "از من انتظار داشت كه در همه حال و شرايط بهترين باشم و به بهترين نحو عمل كنم.",
    "در مورد من بسيار كمال گرا بود به طوري كه هر چيزي بايد به بهترين و كامل ترين نحو صورت مي\u200Cگرفت.",
    "اين احساس را در من ايجاد كرده بود كه انگار هر كاري را كه من انجام می\u200Cدهم ناقص يا اشتباه است.",
    "قوانين سفت و سخت و غير قابل انعطافي براي درست و نادرست قايل بود.",
    "در مقابل انجام نادرست يا كند كارها بسيار ناشكيبا )كم صبر و تحمل (بود",
    "اهميت بسيار زيادي بر درست انجام دادن كارها در مقابل لذت بردن از كار يا آرامش داشتن در كار قايل بود.",
    "در كارهاي من بسيار دخالت مي\u200Cكرد يا در بسيار موارد براي نظرات و كارهاي من ارزشي قايل نبود.",
    "اين احساس را در من ايجاد كرده بود كه من فرد خاصي هستم و از ديگران برتر هستم.",
    "تقاضاهاي زيادي از من داشت و انتظار داشت كه همه چيزها و كارها به روش و سبك او پيش برود.",
    "احساس مسئوليت در قبال ديگران را به من ياد نداده بود.",
    "قوانين و مقررات يا ساختارهاي محدودي را براي من ايجاد كرده بود.",
    "مقررات و مسئوليت هاي كمي براي من ايجاد كرده بود.",
    "به من اجازه داده بود تا بيش از حد عصباني شوم يا كنترل خودم را از دست بدهم.",
    "يك فرد بدون نظم و مقررات بود.",
    "ما بسيار به هم نزديك بوديم به طوري كه كاملاً همديگر را درك مي\u200Cكرديم.",
    "من احساس مي\u200Cكردم كه به حد کافی استقلال و فرديت خودم را نداشته و يك هویت مجزاي از او ندارم.",
    "من احساس مي\u200Cكردم كه انگار در طول رشد نمي\u200Cتوانم خودم را هدايت كنم و جهت خودم را تعيين كنم چون او يك فرد بسيار قدرتمند بود.",
    "من احساس مي\u200Cكردم كه اگر از همديگر جدا شويم آسيب خواهيم ديد.",
    "در مورد مشكلات مالي خانواده بسيار نگران بود.",
    "اين احساس را در من ايجاد كرده بود كه اگر كوچكترين خطايي از من سربزند، اتفاق بدي روي مي\u200Cدهد.",
    "يك ديدگاه منفي گرايانه داشت و اغلب منتظر بدترين نتيجه بود.",
    "بر جنبه\u200Cهاي منفي زندگي يا رويدادها تمركز مي\u200Cكرد.",
    "هر چيزي را تحت كنترل داشت.",
    "براي بيان عواطف و يا حساسيت هاي خود احساس راحتي نمي\u200Cکرد.",
    "سازمان يافته و با ساختار بود، ثبات را به تغيير ترجيح مي\u200Cداد.",
    "به ندرت خشم خود را بيان مي\u200Cكرد.",
    "بسيار تودار بود و به ندرت در مورد احساساتش صحبت مي\u200Cكرد.",
    "وقتي من كار اشتباهي انجام مي\u200Cدادم بسيار خشمگين مي\u200Cشد يا شديداً مرا سرزنش مي\u200Cكرد.",
    "اگر كار خطايي انجام مي دادم مرا تنبيه مي\u200Cكرد.",
    "اگر اشتباهي از من سر مي\u200Cزد مرا با برچسب هايي مثل احمق يا كودن صدا مي\u200Cكرد.",
    "وقتي كارها نادرست پيش مي\u200Cرفت ديگران را مورد سرزنش قرار مي\u200Cداد.",
    "خيلي به موقعيت اجتماعي و ظاهر اهميت مي\u200Cداد.",
    "تأكيد بسيار زيادي بر موفقيت و رقابت داشت.",
    "خيلي نگران اين مسأله بود كه رفتار من چطور در نظر ديگران جلوه مي\u200Cكند.",
    "به نظر مي\u200Cرسيد وقتي كه من كار درست انجام مي\u200Cدادم مرا بيشتر دوست می\u200Cدارد يا توجه بيشتري به من مي\u200Cكند."
)
val questions7 = arrayListOf(
    "وقتی فرزندتان کار خوبی انجام می\u200Cدهد، او را تحسین می\u200cکنید.",
    "فرزندتان را تهدید به تنبیه می\u200Cکنید اما بعد عملاً این کار را نمی\u200Cکنید.",
    "فرزندتان برایتان یادداشت نمی\u200Cگذارد و به شما نمی\u200Cگوید که کجا می\u200Cرود.",
    "وقتی فرزندتان کار بدی می\u200Cکند با حرف زدن، شما را از تنبیه منصرف می\u200Cکند.",
    "فرزندتان شب\u200Cها سر موقع به خانه نمی\u200Cآید.",
    "وقتی فرزندتان کاری را خوب انجام می\u200Cدهد از او تعریف می\u200Cکنید.",
    "اگر فرزندتان خوب رفتار کند تحسینش می\u200Cکنید.",
    "فرزندتان با دوستانی بیرون می\u200Cرود که نمی\u200Cشناسید.",
    "زود از تنبیه فرزندتان منصرف می\u200Cشوید (مثل برداشتن محدودیت\u200Cها زودتر از موعدی که اول گفته بودید)."
)

val questionsList = arrayListOf(
    questions1, questions2, questions3, questions4, questions5,
    questions6, questions7
)
val descriptionList = arrayListOf(
    description1, description2, description3, description4, description5,
    description6, description7, description8, description9
)
