package com.mhmdreza.azmoonyar.data

import android.text.SpannableStringBuilder
import androidx.core.text.bold
import androidx.core.text.toSpannable
import com.mhmdreza.azmoonyar.data.quizes.*


class DataProvider {
     val quizList = arrayListOf(
         getQuiz(QuizType.QUIZ1),
         getQuiz(QuizType.QUIZ2),
         getQuiz(QuizType.QUIZ3),
         getQuiz(QuizType.QUIZ4),
         getQuiz(QuizType.QUIZ5),
         getQuiz(QuizType.QUIZ6),
         getQuiz(QuizType.QUIZ7),
         getQuiz8(),
         getQuiz9()
    )

    companion object{
        private var instance: DataProvider? = null

        @Synchronized
        fun getInstance(): DataProvider {
            if (instance == null){
                instance = DataProvider()
            }
            return instance!!
        }
    }
}

val description1 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("فرم اولیه این پرسشنامه دارای 20 سؤال است که در کشورهای غربی بی\u200Cشک به نوعی مورد توجه بوده است؛ اما با توجه به متفاوت بودن روش فرزندپروری در کشور ایران و کشورهای غربی پرسشنامه با شرایط ایران تنظیم گردید. این پرسشنامه شیوه\u200Cهای فرزند پروری والدین را در سه سطح اندازه\u200Cگیری می\u200Cکند. \n")
    .bold { append("لطفا جملاتی که در ادامه می\u200Cآید را با دقت مطالعه کرده و مناسب\u200Cترین گزینه را انتخاب نمایید.\n") }
    .append("\n\n").toSpannable()


val description2 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("این مقیاس دارای 21 عبارت است که برای ارزیابی 4 سبک فرزندپروری مستبدانه، بی\u200Cاعتنا، سهل\u200Cگیرانه و قاطعانه والدین طراحی و تهیه شده است.")
    .bold { append("لطفا جملاتی که در ادامه می\u200Cآید را به دقت مطالعه کرده و مناسب\u200Cترین گزینه را انخاب نمایید.\n") }
    .append("\n\n")
    .toSpannable()

val description3 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("این ابزار اقتباسی است از نظریه اقتدار والدین كه بر اساس نظریه بامریند از آزادگذاری، استبدادی و اقتدار منطقی والدین، برای بررسی الگوهای نفوذ و شیوه\u200Cهای فرزندپروری ساخته شده است. این پرسشنامه شامل 30 ماده است كه 10 ماده آن به شیوه آزادگذاری مطلق، 10 ماده به شیوه استبدادی و 10 ماده دیگر به شیوه اقتدار منطقی والدین در امر پرورش فرزند مربوط می\u200Cشود. " + "\n")
    .bold { append("والدین گرامی: با سلام\n") }
    .append("\n" + "معمولاً والدین روش\u200Cهای متفاوتی برای تربیت فرزندان به\u200Cكار می\u200Cگیرند. در ادامه عباراتی می\u200Cآید كه برخی از روش\u200Cهای فرزندپروری را توصیف می\u200Cكند. پاسخ هر عبارت در یك پیوستار 5 درجه\u200Cای از كاملاً موافقم تا كاملاً مخالفم قرار گرفته است. لطفاً هر یك از عبارات را به\u200Cدقت مطالعه كرده و مناسب\u200Cترین پاسخ كه با نگرش تربیتی شما هماهنگ است را انتخاب كنید.")
    .append("\n\n")
    .toSpannable()

val description4 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("این پرسشنامه یك ابزار خودگزارشی و دارای 42 عبارت است كه پنج بعد رفتار فرزندپروری: مشاركت والدین، فرزندپروری مثبت، ضعف در نظارت و راهنمایی، عدم ثبات در نحوه برخورد با فرزند و تنبیه بدنی را مورد ارزیابی قرار می\u200Cدهد. \n")
    .bold { append("شیوه نمره\u200Cگذاری \n") }
    .append("آزمودنی (یكی از والدین) در فرم والدین باید در یك مقیاس لیكرت 5 درجه\u200Cای (از هرگز =1 تا همیشه =5) مشخص سازد كه هر یك از عبارات تا چه حد در مورد تعامل وی با فرزندش صدق می\u200Cكند. این مقیاس برای والدینی كه فرزندشان بین 8 تا 16 سال سن دارد، مناسب است. \n" + "در ادامه، تعدادی جمله در مورد خانواده\u200Cتان آمده است. لطفاً بر حسب اینکه هر مورد معمولاً چقدر در خانه\u200Cتان اتفاق می\u200Cافتد به آن\u200Cها امتیاز دهید. پاسخ\u200Cهایی که می\u200Cتوانید از آن\u200Cها استفاده کنید عبارتند از:\n" + "هرگز (1)، تقریباً هیچ وقت (2)، گاهی اوقات (3)، اغلب اوقات (4)، همیشه (5). لطفاً به همه موارد پاسخ بدهید.\n")
    .append("\n\n")
    .toSpannable()

val description5 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("این پرسشنامه یك ابزار خودگزارشی و دارای 42 عبارت است كه پنج بعد رفتار فرزندپروری که عبارتند از مشاركت والدین (پدر و مادر به طور جداگانه)، فرزندپروری مثبت، ضعف در نظارت و راهنمایی، عدم ثبات در نحوه برخورد با فرزند و تنبیه بدنی را مورد ارزیابی قرار می\u200Fدهد. لازم به ذكر است كه عبارات مربوط به زیرمقیاس مشاركت والدین هر كدام از دو بخش تشكیل شده، كه یك بخش مربوط به مشاركت مادر و دیگری مربوط به مشاركت پدر است. \n" + "در ادامه، تعدادی جمله در مورد خانواده\u200Cتان آمده است. لطفاً بر حسب اینکه هر مورد معمولاً چقدر در خانه\u200Cتان اتفاق می\u200Cافتد به آن\u200Cها امتیاز دهید. پاسخ\u200Cهایی که می\u200Cتوانید از آن\u200Cها استفاده کنید عبارتند از:\n" + "هرگز (1)، تقریباً هیچ وقت (2)، گاهی اوقات (3)، اغلب اوقات (4)، همیشه (5). لطفاً به همه موارد پاسخ بدهید.\n")
    .append("\n\n")
    .toSpannable()

val description6 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("پرسشنامه فرزندپروری يانگ که يك ابزار اوليه براي شناسايي ريشه\u200Cهاي دوران كودكي طرح واره\u200Cها است در سال 2003 توسط يانگ تهيه شده است. اين پرسشنامه 72  عبارت دارد كه در آن پاسخ دهنده پدر و مادر خود را به طور جداگانه، براساس نوع رفتاري كه با کودک داشته\u200Cاند، در يك مقياس شش درجه\u200Cاي رتبه بندي مي\u200Cكند. " + "\n")
    .append("عبارت\u200Cهای زير جملاتي هستند كه ممكن است شما در توصيف پدر و مادرتان از آنها استفاده كنيد. لطفاً هر عبارت را به دقت بخوانيد و مشخص كنيد كه كداميك پدر و مادرتان را به خوبي توصيف مي\u200Cكند. با توجه به درجه بندي كه در زير ارائه شده است هر عبارت را براساس اين كه در دوران كودكي شما تا چه حد توصيف كننده پدر و مادرتان است، درجه بندي كنيد. اگر كس ديگري جانشين پدر يا مادرتان بوده است، لطفاً او را درجه بندي كنيد. اگر شما پدر يا مادر نداشته\u200Cايد، ستون مربوطه را خالي بگذاريد.")
    .append("\n\n")
    .toSpannable()

val description7 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("\n" + "این پرسشنامه یك ابزار خودگزارشی و دارای 9 عبارت بوده و سه زیرمقیاس: والدگری مثبت، عدم ثبات در نحوه برخورد با فرزند و ضعف در نظارت و راهنمایی را مورد ارزیابی قرار می\u200Cدهد. \n" + "در ادامه، تعدادی جمله در مورد خانواده\u200Cتان آمده است. لطفاً بر حسب اینکه هر مورد معمولاً چقدر در خانه\u200Cتان اتفاق می\u200Cافتد به آن\u200Cها امتیاز دهید. پاسخ\u200Cهایی که می\u200Cتوانید از آن\u200Cها استفاده کنید عبارتند از:\n" + "هرگز (1)، تقریباً هیچ وقت (2)، گاهی اوقات (3)، اغلب اوقات (4)، همیشه (5). لطفاً به همه موارد پاسخ بدهید.\n")
    .append("\n\n")
    .toSpannable()

val description8 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("مقیاس شیوۀ فرزندپروری به منظور تصحیح برخی از محدویت\u200Cها و نقایص ابزار پیوند والدینی ساخته شد. این آزمون یك مقیاس 15 عبارتی دربارۀ شیوه فرزندپروری نامطلوب است.\n" + "در این آزمون در واقع این نوجوانان هستند که سبک فرزندپروری والدین خود را مورد ارزیابی قرار می دهند.\n" + "\n" + "\n" + " آزمودنی\u200Cها باید با استفاده از یك مقیاس لیكرت 4 درجه\u200Cای (به هیچ وجه درست نیست=0، كمی درست= 1، تقریباً درست =2 و كاملاً درست=3) مشخص سازند كه عبارت مورد نظر تا چه حد معرف رفتار پدر یا مادر آنها در خلال 16 سال اول زندگی بوده است. مقیاس شیوۀ فرزندپروری دارای دو فرم جداگانه (یكی مربوط به مادر و دیگری مربوط به پدر) است كه برحسب ماهیت پژوهش و هدف از اجرای آزمون می\u200Cتوان از دو فرم یا تنها یكی از فرم\u200Cها استفاده كرد. این آزمون دارای 3 زیرمقیاس: بی\u200Cتفاوت  (6 عبارت)، كنترل مفرط (4 عبارت) و سوءاستفاده (بدرفتاری)  (5 عبارت) است.\n")
    .append("\n\n")
    .toSpannable()

val description9 = SpannableStringBuilder()
    .bold { append("\n\nمعرفی\n") }
    .append("\n" + "این پرسشنامه 30 ماده\u200Cای توسط آرنولد و همكاران (1993) طراحی شده و با پاسخ به آن، بهترین توصیف از شیوه فرزندپروری در طی دو ماه گذشته به\u200Cصورت خودسنجی و توسط خود والدین به\u200Cدست می\u200Cآید. این پرسشنامه سه الگوی انضباطی ناكارآمد والدین را می\u200Cسنجد. \n")
    .bold { append("والدین گرامی: با سلام\n") }
    .append(
        "معمولاً شما روش\u200Cهای متفاوتی برای برخورد با مشكلات پیش می\u200Cگیرید. در متن زیر عباراتی است كه برخی  از روش\u200Cهای فرزندپروری را توصیف می\u200Cكند. برای هر عبارت یك مقیاس 7 درجه\u200Cای آمده كه در دو طرف آن دو نمونه رفتار توصیف شده است كه معمولاً در نقطه مقابل یكدیگر هستند. مثلاً در مورد مثال زیر یعنی \"هنگام صرف غذا \" در سمت راست نوشته شده است كه \" می\u200C\u200Cگذارم كودكم تصمیم بگیرد چقدر بخورد.\" و در سمت چپ دقیقاً رفتار متضاد آن آمده است. یعنی \"من تصمیم می\u200Cگیرم كودكم چقدر بخورد.\" اگر روش شما همیشه و دقیقاً مطابق جمله سمت راست است در جدول علامت بزنید، اگر اكثر اوقات روش جمله سمت راست را استفاده می\u200Cكنید ولی نه همیشه، در عدد 2 را علامت بزنید. اما اگر روش شما همیشه و دقیقاً مطابق جمله سمت چپ است، عدد 7 را علامت بزنید و در صورتی كه اكثر اوقات چنین است، عدد 6 را علامت بزنید. اگر گاهی از این روش و گاهی از آن روش استفاده می\u200Cكنید، بر اساس این\u200Cكه بیشتر به كدام روش متمایل است در اعداد 3، 4، یا 5 را انتخاب كنید. لطفاً\u200C جملات زیر را بخوانید و در مورد هر جمله، عددی كه بهتر از همه روش فرزندپروری شما را در طی دو ماه گذشته توصیف می\u200Cكند، را علامت بزنید."
    )
    .append("\n\n")
    .toSpannable()


val questions1 = arrayListOf(
    "والدین باید زمانی را در کنار کودکان باشند تا لذت در کنار هم بودن را تجربه کنند.",
    "والدین باید محبت خود به کودکان را به طور کلامی ابراز کنند.",
    "والدین باید دلیل کارهای خود در خانه را توضیح دهند و ریشه مشکلات را شناسایی کنند.",
    "والدین باید روش صحیح آداب و احترام به بزرگتر  را به فرزندان یاد دهند.",
    "توقع والدین از کودکان باید در حد توان و درک آن\u200Cها باشد.",

    "بچه\u200Cها نباید هیچ مخالفتی نسبت خواسته پدر و مادر داشته باشند.",
    "والدین باید اجازه دهند کودکان کنجکاوی کنند و هر چه را که در جهت افزایش کارایی مثبت کودک مورد نیاز است فراهم نمایند.",
    "والدین باید با تقویت نیروی ایمان و الگو بودن، گودکان را آموزش و مشاوره دهند و هدایت نمایند.",
    "با کودکان باید با زبان خود آن\u200Cها سخن گفت و دلایل منطقی بعضی از مخالفت\u200Cها را بیان کرد.",
    "والدین باید در تصمیم\u200Cگیری\u200Cها آن\u200Cچه صلاح خانواده است انجام دهند.",

    "اگر والدین وقت و فرصت کافی برای گوش کردن به صحبت کودکان داشته باشند مشکلات کمتر می\u200Cشود.",
    "والدین باید به نظرات فرزندان گوش دهند و در صورت مفید بودن از آن هم استفاده کنند.",
    "والدین می\u200Cتوانند با نظرات غیر اصولی و غیر اخلاقی کودکان مخالفت کنند.",
    "والدین باید با بچه\u200Cها اجازه دهند تا در تصمیم\u200Cگیری\u200Cها نقش داشته باشند تا معنای مشورت را بدانند. ",
    "شوخی و بازی غیر اخلاقی بچه\u200Cها در حضور والدین صحیح نیست.",

    "والدین در مواقعی باید کودکان را نوازش کرده و در آغوش بگیرند.",
    "بچه\u200Cها باید جرأت بیان عقاید و اظهار نظر در حضور والدین داشته باشند.",
    "کودکان اذیت کار باید به\u200Cطور غیر مستقیم بیاموزند و از بزرگ\u200Cترها حساب ببرند و دلایل منطقی را بدانند.",
    "کودکان باید اجازه داشته باشند مشکلات خود را با والدین مطرح کنند و والدین باید صبور باشند.",
    "اگر بچه\u200Cها را زیر نظر نداشته باشیم و تذکرات توأم با نصیحت به موقع ندهیم تلاش نمی\u200Cکنند و پیشرفت نخواهند کرد."
)

val questions2 = arrayListOf(
    "والدین باید به بچه\u200Cهای خود اجازه دهند تا هر موقع مایلند به تکالیف درسی خود بپردازند",
    "بچه\u200Cها باید همیشه در هرکاری مخصوصاً تحصیلات رضایت والدین را جلب کنند در غیر این \u200Cصورت باید تنبیه شوند.",
    "در تعیین رشته\u200C تحصیلی باید والدین تصمیم\u200Cگیرنده باشند زیرا فرزندان صلاح خود را نمی\u200Cدانند.",
    "در صورتی\u200Cکه فرزندان به کاری غیر از آن\u200Cچه والدین صحیح می\u200Cدانند بپردازند، باید با دلیل آن\u200Cها را راهنمایی کرد.",
    "5بچه\u200Cها خود به خود به سمت آن\u200Cچه که برای آن\u200Cها مناسب است هدایت می\u200Cشوند و باید از امر و نهی زیاد آن\u200Cها پرهیز کرد.",
    "در انتخاب رشته تحصیلی و انتخاب حرفه برای آینده فرزندان، والدین باید هدایت\u200Cکننده باشند و نظر خود را تحمیل نکنند.",
    "فرزندان در عقاید مذهبی باید پیرو والدین\u200Cشان باشند، اما اگر خلاف میل آن\u200Cها بود باید بتوانند آزادانه آن را با والدین مطرح کنند.",
    "مذهب و اعتقادات چیزی نیست که بچه\u200Cها بتوانند در مورد آن با والدین مخالفت کنند.",
    "عقاید و مذهب چیزی نیست که به فرزندان دیکته شود، باید آن\u200Cها را در انتخاب آزاد گذاشت.",
    "اگر فرزندان در برخی موارد برخلاف والدین عمل کردند، والدین به\u200Cجای تنبیه باید آن\u200Cها را راهنمایی کنند.",
    "از همان دوره کودکی فرزندان باید متوجه شوند که حاکم خانواده کیست.",
    "تمام مشکلات بچه\u200Cها این است که پدر و مادرها بیش از اندازه آن\u200Cها را محدود می\u200Cکنند.",
    "در صورت مخالفت فرزندان با نظرات والدین باید به\u200Cشدت با آن\u200Cها برخورد کرد.",
    "باید به فرزندان در هر سنی اجازه داد برای خود تصمیم بگیرند.",
    "فرزندان برای بازی و تفریح باید بتوانند در هر موقعیتی از خانه خارج شوند.",
    "تفریح و بازی در حضور پدر و مادر یک بی\u200Cاحترامی به حساب می\u200Cآید.",
    "اگر در مواردی فرزندان کار اشتباهی انجام دهند هرگز نباید آن\u200Cها را سرزنش کرد.",
    "اگر والدین برای فرزندان تصمیمی بگیرند که بر خلاف میل آن\u200Cها باشد باید با آن\u200Cها گفتگو کنند یا حتی اگر در تصمیم خود اشتباه کرده بودند، آن را بپذیرند.",
    "فرزندان باید آزاد گذاشته شوند تا با تجربه کردن خودشان آینده\u200Cی خود را رقم بزنند.",
    "هر چند فرزندان گاهی اشتباه می\u200Cکنند، ولی در بعضی اوقات نظرات آن\u200Cها قابل قبول است.",
    "اگر فرزندان به محدویت\u200Cهایی که والدین برای آن\u200Cها قائلند اعتراض داشتند والدین باید با صحبت کردن آن\u200Cها را قانع کنند."
)

val questions3 = arrayListOf(
    "والدین باید به بچه\u200Cهای خود اجازه دهند تا هر آنچه را كه می\u200Cخواهند انجام دهند.",
    "بچه\u200Cها باید فقط از آنچه كه والدینشان می\u200Cگویند پیروی كنند و در غیر این صورت باید آنها را تنبیه كرد.",
    "اگر به مشكلات بچه\u200Cها توجه شود این دردسر را به دنبال دارد كه آنها پرروتر شده و انتظارات بیشتری از والدین خواهند داشت.",
    "هرگاه والدین تصمیمی برای بچه\u200Cها بگیرند باید دلایل آن را به آنها بگویند.",
    "اگر بچه\u200Cها نسبت به محدودیت ایجاد شده در خانواده اعتراض كردند، والدین باید با صحبت كردن آنها را قانع كنند.",
    "والدین نباید در كارهای مربوط به بچه\u200Cها دخالت كنند چون بچه\u200Cها به\u200Cطور ذاتی راه خودشان را پیدا می\u200Cكنند.",
    "اگر بچه\u200Cها كاملاً مطابق میل والدین خود رفتار كنند در آینده افراد موفقی خواهند شد. ",
    "بچه\u200Cها باید كاری را كه والدین از آنها انتظار دارند انجام دهند، اما اگر انتظارات والدین غیر قابل اجرا بود باید بتوانند آن\u200C را آزادانه با والدین خود مطرح كنند. ",
    "وقتی والدین از بچه\u200Cها می\u200Cخواهند تا كاری را انجام دهند، بچه\u200Cها باید بدون چون و چرا آن\u200Cرا انجام دهند.",
    "والدین نباید بچه\u200Cها را در منزل محدود كنند بلكه باید آنها را آزاد بگذارند تا تمام لوازم اطراف خود را دستكاری كنند.",
    "هرگاه بچه\u200Cها برخلاف میل والدین رفتار كردند والدین باید به\u200Cجای تنبیه آنها را راهنمایی كنند.",
    "والدین خیلی زود باید به بچه\u200Cها بفهمانند كه رئیس خانواده چه كسی است.",
    "والدین باید در تصمیم\u200Cگیری\u200Cهای مربوط به خانواده فقط آنچه را كه خواست بچه\u200Cها است، انجام دهند.",
    "اگر والدین رفتار و خواسته\u200Cهای بچه\u200Cها را محدود نكنند، بیشتر مشكلات حل می\u200Cشود.",
    "والدین باید هنگام تصمیم\u200Cگیری در مورد مسائل و برنامه\u200Cهای خانواده نظر بچه\u200Cها را دخالت دهند و از آنها نیز نظرخواهی كنند.",
    "والدین باید با بچه\u200Cهایی كه با نظر آنها مخالفت می\u200Cكنند به شدت برخورد نمایند.",
    "والدین باید به بچه\u200Cها اجازه دهند تا در كارها خودشان تصمیم\u200Cگیرنده باشند.",
    "شوخی و بازی كردن بچه\u200Cها در حضور والدین توهین به آنها است.",
    "بچه\u200Cها به بازی و تفریح نیاز دارند، برای این كار والدین باید به آنها اجازه دهند هر وقت دلشان خواست از منزل خارج شوند.",
    "باید به بچه\u200Cها اجازه داده شود كه اگر فكر می\u200Cكنند نظرشان از نظرات والدین خود بهتر است آن را ابراز كنند.",
    "وقتی بچه\u200Cها مرتكب اشتباهی می\u200Cشوند هیچ\u200Cگاه نباید آنها را سرزنش كرد.",
    "اگر والدین تصمیمی برخلاف میل بچه\u200Cها گرفتند در چنین مواردی باید با بچه\u200Cها گفتگو كنند و حتی اگر اشتباه كرده بودند آن را بپذیرند.",
    "گاهی اوقات والدین باید با بچه\u200Cها سازش كنند، نه این\u200Cكه همیشه انتظار داشته باشند كه بچه\u200Cها با آنها سازش كنند.",
    "باید اجازه داد تا بچه\u200Cها خودشان تجربه كنند.",
    "بعضی از بچه\u200Cها ذاتاً بد هستند و باید طوری تربیت شوند كه از والدین خود بترسند.",
    "بچه\u200Cها وقتی بزرگ شوند از سخت\u200Cگیری\u200Cهای والدین خود سپاسگذاری خواهند كرد.",
    "وقتی بچه\u200Cها دچار مشكل و دردسری شوند (كارخطایی انجام \u200Cدهند) باید بدانند كه با مطرح كردن آن مشكل برای والدین خود تنبیه نمی\u200Cشوند.",
    "در مجالس و مهمانی\u200Cها باید بچه\u200Cها را آزاد گذاشت تا محیط اطراف خود را دستكاری كنند تا حس كنجكاوی آنها ارضا شود.",
    "بچه\u200Cها جدی و كوشا نخواهند بود مگر این\u200Cكه درباره كارهای آنها سخت\u200Cگیری كنیم.",
    "اگر چه بچه\u200Cها تجربه كمی دارند اما گاهی اوقات نظر آنها بهتر از نظر والدین است."
)


val questions4 = arrayListOf(
    "با فرزندتان صحبت\u200Cهای دوستانه\u200Cای دارید.",
    "زمانی كه فرزندتان كار خوبی انجام می\u200Cدهد، شما او را متوجه آن كار خوب می\u200Cكنید.",
    "فرزندتان را تهدید به تنبیه می\u200Cكنید، اما بعداً تنبیهش نمی\u200Cكنید.",
    "داوطلب كمك به فعالیت\u200Cهای خاصی كه فرزندتان درگیر آن است، می\u200Cشوید (مثلاً بازی، ورزش، فعالیت\u200Cهای گروه\u200Cهای مذهبی و ...).",
    "رفتار خوب فرزندتان را با جایزه یا پاداش مورد تشویق قرار می\u200Cدهید.",
    "اگر فرزندتان بخواهد جایی برود برای شما یادداشت نمی\u200Cگذارد تا بدانید كه كجا رفته است.",
    "با فرزندتان به بازی و تفریح می\u200Cپردازید.",
    "وقتی فرزندتان كار اشتباهی انجام می\u200Cدهد بدون آنكه تنبیه شود، با او صحبت می\u200Cكنید.",
    "در مورد فعالیت\u200Cهای روزانه فرزندتان در مدرسه پرس و جو می\u200Cكنید.",
    "فرزندتان غروب، پس از زمانی كه انتظار می\u200Cرود در خانه باشد، بیرون می\u200Cماند.",
    "در انجام تكالیف مدرسه به فرزندتان كمك می\u200Cكنید.",
    "تلاش شما برای وادار كردن فرزندتان به انجام كارها بیهوده است چون این كار برایتان دشوار است.",
    "وقتی فرزندتان كار خوبی انجام می\u200Cدهد، شما او را تحسین می\u200Cكنید.",
    "از فرزندتان در مورد برنامه\u200Cای كه برای فردای آن روز دارد، پرس و جو می\u200Cكنید.",
    "فرزندتان را به انجام كارهای خاصی وادار می\u200Cكنید.",
    "به خاطر رفتار خوبی كه فرزندتان داشته است، به او جایزه می\u200Cدهید.",
    "دوستان فرزندتان (آن\u200Cهایی كه با او هستند) را نمی\u200Cشناسید.",
    "وقتی فرزندتان كار خوبی انجام می\u200Cدهد، وی را به آغوش می\u200Cكشید یا می\u200Cبوسید.",
    "فرزندتان بدون آنكه ساعت بازگشت خود را مشخص كند از خانه خارج می\u200Cشود.",
    "فرزندتان درباره دوستانش با شما صحبت می\u200Cكند.",
    "فرزندتان پس از تاریک شدن هوا، بدون همراهی شما بیرون می\u200Cرود.",
    "زودتر از موعد مقرر تنبیه فرزندتان را قطع می\u200Cكنید (مثلاً برداشتن محدودیت زودتر از آنچه، اول گفته\u200Cاید).",
    "فرزندتان در برنامه\u200Cریزی فعالیت\u200Cهای خانوادگی كمك می\u200Cكند.",
    "شما آنقدر مشغول می\u200Cشوید كه فراموش می\u200Cكنید فرزندتان كجاست و چه می\u200Cكند.",
    "وقتی فرزندتان كار اشتباهی انجام می\u200Cدهد، تنبیهش نمی\u200Cكنید.",
    "در جلسات اولیا و مربیان، یا دیگر جلسات مدرسه فرزندتان شركت می\u200Cكنید.",
    "وقتی فرزندتان در امور خانه كمك می\u200Cكند، شما به او می\u200Cگویید كه از كارش خشنود شده\u200Cاید.",
    "وقتی فرزندتان دیر به خانه می\u200Cآید، شما متوجه دیر آمدن او نمی\u200Cشوید.",
    "بدون اینكه به فرزندتان بگویید به كجا می\u200Cروید، خانه را ترك می\u200Cكنید.",
    "فرزندتان با بیش از یك ساعت تأخیر از زمان تعیین شده\u200Cای كه شما منتظرش هستید، از مدرسه به خانه می\u200Cآید.",
    "شكل و نوع تنبیهی كه برای فرزندتان به كار می\u200Cبرید، به وضعیت روحی\u200Cتان بستگی دارد.",
    "فرزندتان بدون اینكه بزرگتری با او باشد، در خانه تنهاست.",
    "وقتی فرزندتان كار اشتباهی انجام می\u200Cدهد، با دست محكم به پشت او می\u200Cزنید.",
    "وقتی فرزندتان رفتار اشتباهی انجام می\u200Cدهد، مورد بی\u200Cاعتنایی شما قرار می\u200Cگیرد.",
    "وقتی فرزندتان كار اشتباهی انجام می\u200Cدهد، به او سیلی می\u200Cزنید.",
    "امتیازات یا پولی را كه به فرزندتان داده\u200Cاید، به عنوان تنبیه از او پس می\u200Cگیرید.",
    "برای تنبیه، فرزندتان را به اتاقش می\u200Cفرستید.",
    "وقتی فرزندتان كار اشتباهی انجام می\u200Cدهد، شما او را با كمربند، دسته كلید یا اشیای دیگر می\u200Cزنید.",
    "وقتی فرزندتان كار اشتباهی انجام می\u200Cدهد، شما سرش داد و فریاد می\u200Cكنید.",
    "هنگامی كه فرزندتان بدرفتاری می\u200Cكند، شما با خونسردی توضیخ می\u200Cدهید كه چرا رفتارش اشتباه بوده است.",
    "برای تنبیه فرزندتان از روش محروم كردن استفاده می\u200Cكنید (مثلاً برای مدتی او را از انجام فعالیت\u200Cهای مورد علاقه\u200Cاش منع می\u200Cكنید).",
    "به عنوان تنبیه فرزندتان را وادار به انجام كارهای سخت می\u200Cكنید."
)


val questions5 = arrayListOf(
    "با مادرتان صحبت\u200Fهای دوستانه\u200Fای دارید.",
    "با پدرتان صحبت\u200Fهای دوستانه\u200Fای دارید.",
    "زمانی كه كار خوبی انجام می\u200Fدهید، والدینتان شما را متوجه آن كار خوب می\u200Fكنند.",
    "والدینتان شما را تهدید به تنبیه می\u200Fكنند، اما بعداً تنبیه\u200Cتان نمی\u200Fكنند.",
    "مادرتان داوطلب كمك به فعالیت\u200Fهای خاصی كه شما درگیر آن هستید می\u200Fشود (مثلاً بازی، ورزش، فعالیت\u200Fهای گروه\u200Fهای مذهبی و ...).",
    "پدرتان داوطلب كمك به فعالیت\u200Fهای خاصی كه شما درگیر آن هستید می\u200Fشود (مثلاً بازی، ورزش، فعالیت\u200Fهای گروه\u200Fهای مذهبی و ...).",
    "والدینتان رفتار خوب شما را با جایزه یا پاداش مورد تشویق قرار می\u200Fدهند.",
    "اگر شما بخواهید جایی بروید برای والدینتان یادداشت نمی\u200Fگذارید تا بدانند كه كجا رفته\u200Fاید.",
    "با مادرتان به بازی و تفریح می\u200Fپردازید.",
    "با پدرتان به بازی و تفریح می\u200Fپردازید.",
    "وقتی كار اشتباهی انجام می\u200Fدهید بدون آنكه تنبیه شوید، با والدینتان صحبت می\u200Fكنید.",
    "مادرتان در مورد فعالیت\u200Fهای روزانه شما در مدرسه پرس و جو می\u200Fكند.",
    "پدرتان در مورد فعالیت\u200Fهای روزانه شما در مدرسه پرس و جو می\u200Fكند.",
    "غروب، پس از زمانی كه انتظار می\u200Fرود در خانه باشید، بیرون می\u200Fمانید.",
    "مادرتان در انجام تكالیف مدرسه به شما كمك می\u200Fكند.",
    "پدرتان در انجام تكالیف مدرسه به شما كمك می\u200Fكند.",
    "تلاش والدینتان برای وادار كردن شما به انجام كارها بیهوده است چون آن\u200Cها می\u200Fدانند این كار برایشان دشوار است.",
    "وقتی كار خوبی انجام می\u200Fدهید، والدینتان شما را تحسین می\u200Fكنند.",
    "مادرتان از شما در مورد برنامه\u200Fای كه برای فردای آن روز دارید، پرس و جو می\u200Fكند.",
    "پدرتان از شما در مورد برنامه\u200Fای كه برای فردای آن روز دارید، پرس و جو می\u200Fكند.",
    "مادرتان شما را به انجام كارهای خاصی وادار می\u200Fكند.",
    "پدرتان شما را به انجام كارهای خاصی وادار می\u200Fكند.",
    "به خاطر رفتار خوبی كه داشته\u200Fاید، والدینتان به شما جایزه می\u200Fدهند.",
    "والدینتان دوستان (آنهایی كه با شما هستند) شما را نمی\u200Fشناسند.",
    "وقتی كار خوبی انجام می\u200Fدهید، والدینتان شما را به آغوش می\u200Fكشند یا می\u200Fبوسند.",
    "بدون آنكه ساعت بازگشت خود را مشخص كنید از خانه خارج می\u200Fشوید.",
    "مادرتان درباره دوستانتان با شما صحبت می\u200Fكند.",
    "پدرتان درباره دوستانتان با شما صحبت می\u200Fكند.",
    "پس از تاریک شدن هوا، بدون همراهی پدر یا مادرتان بیرون می\u200Cروید.",
    "والدینتان زودتر از موعد مقرر تنبیه شما را قطع می\u200Fكنند (مثلاً برداشتن محدودیت، زودتر از آنچه اول گفته\u200Fاند).",
    "شما در برنامه\u200Fریزی فعالیت\u200Fهای خانوادگی كمك می\u200Fكنید.",
    "والدینتان آنقدر مشغول می\u200Fشوند كه فراموش می\u200Fكنند شما كجایید و چه می\u200Fكنید.",
    "وقتی كار اشتباهی انجام می\u200Fدهید، والدینتان تنبیه\u200Cتان نمی\u200Fكنند.",
    "مادرتان در جلسات اولیا و مربیان، یا دیگر جلسات مدرسه شركت می\u200Fكند.",
    "پدرتان در جلسات اولیا و مربیان، یا دیگر جلسات مدرسه شركت می\u200Fكند.",
    "وقتی در امور خانه كمك می\u200Fكنید، والدینتان به شما می\u200Fگویند كه از كار شما خشنود شده\u200Fاند.",
    "وقتی شما دیر به خانه می\u200Fآید، والدینتان متوجه دیر آمدن شما نمی\u200Fشوند.",
    "والدینتان بدون اینكه به شما بگویند به كجا می\u200Fروند، خانه را ترك می\u200Fكنند.",
    "شما با بیش از یك ساعت تأخیر از زمان تعیین شده\u200Fای كه والدینتان منتظرتان هستند، از مدرسه به خانه می\u200Fآیید.",
    "شكل و نوع تنبیهی كه والدینتان برای شما به كار می\u200Fبرند، به وضعیت روحیشان بستگی دارد.",
    "شما بدون اینكه بزرگتری با شما باشد، در خانه تنهایید.",
    "وقتی كار اشتباهی انجام می\u200Fدهید، والدینتان با دست محكم به پشت شما می\u200Fزنند.",
    "وقتی رفتار اشتباهی انجام می\u200Fدهید، مورد بی\u200Fاعتنایی والدینتان قرار می\u200Fگیرید.",
    "وقتی كار اشتباهی انجام می\u200Fدهید، والدینتان به شما سیلی می\u200Fزنند.",
    "والدینتان امتیازات یا پولی را كه به شما داده\u200Fاند، به عنوان تنبیه از شما پس می\u200Fگیرند.",
    "والدینتان برای تنبیه، شما را به اتاقتان می\u200Fفرستند.",
    "وقتی شما كار اشتباهی انجام می\u200Fدهید، والدینتان شما را با كمربند، دسته كلید یا اشیای دیگر می\u200Fزنند.",
    "وقتی شما كار اشتباهی انجام می\u200Fدهید، والدینتان سرتان داد و فریاد می\u200Fكنند.",
    "هنگامی كه شما بدرفتاری می\u200Fكنید، والدینتان با خونسردی توضیح می\u200Fدهند كه چرا رفتارتان اشتباه بوده است.",
    "والدینتان برای تنبیه شما از روش محروم كردن استفاده می\u200Fكنند (مثلاً برای مدتی شما را از انجام فعالیت\u200Fهای مورد علاقه\u200Fتان منع می\u200Fكنند).",
    "والدینتان به عنوان تنبیه شما را وادار به انجام كارهای سخت می\u200Fكنند."
)

val questions6 = arrayListOf(
    "عاشقانه مرا دوست داشت و با من مانند یك فرد خاص رفتار می\u200Cكرد.",
    "زمان هایی را به من اختصاص می\u200Cداد و به من توجه می\u200Cكرد.",
    "راهنمایی مفید و مشورت كمك كننده به من می\u200Cداد.",
    "حرف\u200Cهای مرا گوش می\u200Cكرد، مرا می\u200Cفهمید، مرا در احساسات خود سهیم می\u200Cكرد.",
    "گرم بود و محبت خود را به صورت نوازش و در آغوش گرفتن من نشان می\u200Cداد.",
    "وقتی من بچه بودم فوت كرد یا منزل را برای همیشه ترك كرد.",
    "فردی غیر قابل پیش بینی، دارای خلق ناپایدار بود.",
    "برادران یا خواهرانم را به من ترجیح می\u200Cداد.",
    "برای مدت زمان های طولانی مرا تنها می\u200Cگذاشت.",
    "به من دروغ می\u200Cگفت، مرا فریب می داد، با من دشمنی می\u200Cكرد.",
    "مرا مورد آزار جسمی، جنسی یا هیجانی قرار می\u200Cداد.",
    "از من برای ارضای نیازهایش استفاده می\u200C\u200Cكرد.",
    "بنظر می\u200Cرسید كه از آزار دادن دیگران لذت می\u200Cبرد.",
    "شدیداً نگران بود كه مبادا به من آسیبی برسد. ",
    "شدیداً نگران بود از این كه من بیمار شوم.",
    "یك فرد ترسو بود. ",
    "بسیار از من حمایت می\u200Cكرد.",
    "طوری با من رفتار كرده بود كه من احساس كنم نمی\u200Cتوانم به تصمیمات یا قضاوت\u200Cهای خودم اعتماد داشته باشم.",
    "به جای این كه اجازه بدهد من خودم به سبكی كه می\u200Cخواهم كارهایی را انجام دهم، برای من كارهای زیادی می\u200Cكرد.",
    "طوری با من رفتار می\u200Cكرد كه انگار من خیلی جوانتر (كم سنتر) از سن واقعیم بودم.",
    "خیلی مرا سرزنش می\u200Cكرد.",
    "طوری با من رفتار كرده بود كه من احساس می\u200Cكردم دوست نداشتنی یا طرد شده هستم.",
    "طوری با من رفتار می\u200Cكرد كه انگار من ایرادی داشتم.",
    "طوری با من رفتار كرده بود كه من از این كه مورد احترام قرار بگیرم خجالت می\u200Cكشیدم.",
    "هرگز آموزش های لازم برای موفقیت در مدرسه را به من نیاموخت.",
    "طوری با من رفتار می\u200Cكرد كه انگار من احمق یا دست و پا چلفتی هستم.",
    "واقعاً نمی\u200Cخواست كه من موفق شوم.",
    "انتظار داشت كه من در زندگی یك شكست خورده باشم.",
    "طوری با من رفتار می\u200Cکرد كه انگار نقطه نظرات یا خواسته های من اهمیتی ندارد.",
    "بدون در نظر گرفتن خواسته های من، هر كاری كه می\u200Cخواست انجام می\u200Cداد.",
    "طوری زندگی من را كنترل می\u200Cكرد كه من حداقل آزادی را برای انتخاب داشتم.",
    "هر چیزی مطابق نظرات و خواسته های والدینم بود.",
    "نیازهای خودش را قربانی منافع خانواده می\u200Cكرد.",
    "قادر نبود مسئولیت های روزانه خودش را انجام دهد در نتیجه من مجبور بودم بیش از مسئولیت خودم كار كنم.",
    "ناخرسند بود و برای حمایت و درك شدن به من متكی بود.",
    "احساس قوی بودن را در من ایجاد كرده بود به طوری كه من تصور می\u200Cکردم باید از دیگران مراقبت كنم.",
    "انتظارات بسیار زیادی از خودش داشت. ",
    "از من انتظار داشت كه در همه حال و شرایط بهترین باشم و به بهترین نحو عمل كنم.",
    "در مورد من بسیار كمال گرا بود به طوری كه هر چیزی باید به بهترین و كامل ترین نحو صورت می\u200Cگرفت.",
    "این احساس را در من ایجاد كرده بود كه انگار هر كاری را كه من انجام می\u200Cدهم ناقص یا اشتباه است.",
    "قوانین سفت و سخت و غیر قابل انعطافی برای درست و نادرست قایل بود.",
    "در مقابل انجام نادرست یا كند كارها بسیار ناشكیبا )كم صبر و تحمل (بود",
    "اهمیت بسیار زیادی بر درست انجام دادن كارها در مقابل لذت بردن از كار یا آرامش داشتن در كار قایل بود.",
    "در كارهای من بسیار دخالت می\u200Cكرد یا در بسیار موارد برای نظرات و كارهای من ارزشی قایل نبود.",
    "این احساس را در من ایجاد كرده بود كه من فرد خاصی هستم و از دیگران برتر هستم.",
    "تقاضاهای زیادی از من داشت و انتظار داشت كه همه چیزها و كارها به روش و سبك او پیش برود.",
    "احساس مسئولیت در قبال دیگران را به من یاد نداده بود.",
    "قوانین و مقررات یا ساختارهای محدودی را برای من ایجاد كرده بود.",
    "مقررات و مسئولیت های كمی برای من ایجاد كرده بود.",
    "به من اجازه داده بود تا بیش از حد عصبانی شوم یا كنترل خودم را از دست بدهم.",
    "یك فرد بدون نظم و مقررات بود.",
    "ما بسیار به هم نزدیك بودیم به طوری كه كاملاً همدیگر را درك می\u200Cكردیم.",
    "من احساس می\u200Cكردم كه به حد کافی استقلال و فردیت خودم را نداشته و یك هویت مجزای از او ندارم.",
    "من احساس می\u200Cكردم كه انگار در طول رشد نمی\u200Cتوانم خودم را هدایت كنم و جهت خودم را تعیین كنم چون او یك فرد بسیار قدرتمند بود.",
    "من احساس می\u200Cكردم كه اگر از همدیگر جدا شویم آسیب خواهیم دید.",
    "در مورد مشكلات مالی خانواده بسیار نگران بود.",
    "این احساس را در من ایجاد كرده بود كه اگر كوچكترین خطایی از من سربزند، اتفاق بدی روی می\u200Cدهد.",
    "یك دیدگاه منفی گرایانه داشت و اغلب منتظر بدترین نتیجه بود.",
    "بر جنبه\u200Cهای منفی زندگی یا رویدادها تمركز می\u200Cكرد.",
    "هر چیزی را تحت كنترل داشت.",
    "برای بیان عواطف و یا حساسیت های خود احساس راحتی نمی\u200Cکرد.",
    "سازمان یافته و با ساختار بود، ثبات را به تغییر ترجیح می\u200Cداد.",
    "به ندرت خشم خود را بیان می\u200Cكرد.",
    "بسیار تودار بود و به ندرت در مورد احساساتش صحبت می\u200Cكرد.",
    "وقتی من كار اشتباهی انجام می\u200Cدادم بسیار خشمگین می\u200Cشد یا شدیداً مرا سرزنش می\u200Cكرد.",
    "اگر كار خطایی انجام می دادم مرا تنبیه می\u200Cكرد.",
    "اگر اشتباهی از من سر می\u200Cزد مرا با برچسب هایی مثل احمق یا كودن صدا می\u200Cكرد.",
    "وقتی كارها نادرست پیش می\u200Cرفت دیگران را مورد سرزنش قرار می\u200Cداد.",
    "خیلی به موقعیت اجتماعی و ظاهر اهمیت می\u200Cداد.",
    "تأكید بسیار زیادی بر موفقیت و رقابت داشت.",
    "خیلی نگران این مسأله بود كه رفتار من چطور در نظر دیگران جلوه می\u200Cكند.",
    "به نظر می\u200Cرسید وقتی كه من كار درست انجام می\u200Cدادم مرا بیشتر دوست می\u200Cدارد یا توجه بیشتری به من می\u200Cكند."
)
val questions7 = arrayListOf(
    "وقتی فرزندتان کار خوبی انجام می\u200Cدهد، او را تحسین می\u200cکنید.",
    "فرزندتان را تهدید به تنبیه می\u200Cکنید اما بعد عملاً این کار را نمی\u200Cکنید.",
    "فرزندتان برایتان یادداشت نمی\u200Cگذارد و به شما نمی\u200Cگوید که کجا می\u200Cرود.",
    "وقتی فرزندتان کار بدی می\u200Cکند با حرف زدن، شما را از تنبیه منصرف می\u200Cکند.",
    "فرزندتان شب\u200Cها سر موقع به خانه نمی\u200Cآید.",
    "وقتی فرزندتان کاری را خوب انجام می\u200Cدهد از او تعریف می\u200Cکنید.",
    "اگر فرزندتان خوب رفتار کند تحسینش می\u200Cکنید.",
    "فرزندتان با دوستانی بیرون می\u200Cرود که نمی\u200Cشناسید.",
    "زود از تنبیه فرزندتان منصرف می\u200Cشوید (مثل برداشتن محدودیت\u200Cها زودتر از موعدی که اول گفته بودید)."
)

val questionsList = arrayListOf(
    questions1, questions2, questions3, questions4, questions5,
    questions6, questions7
)
val descriptionList = arrayListOf(
    description1, description2, description3, description4, description5,
    description6, description7, description8, description9
)
